/* automatically generated by rust-bindgen 0.69.4 */

pub const THOST_FTDC_EXP_Normal: u8 = 48u8;
pub const THOST_FTDC_EXP_GenOrderByTrade: u8 = 49u8;
pub const THOST_FTDC_ICT_EID: u8 = 48u8;
pub const THOST_FTDC_ICT_IDCard: u8 = 49u8;
pub const THOST_FTDC_ICT_OfficerIDCard: u8 = 50u8;
pub const THOST_FTDC_ICT_PoliceIDCard: u8 = 51u8;
pub const THOST_FTDC_ICT_SoldierIDCard: u8 = 52u8;
pub const THOST_FTDC_ICT_HouseholdRegister: u8 = 53u8;
pub const THOST_FTDC_ICT_Passport: u8 = 54u8;
pub const THOST_FTDC_ICT_TaiwanCompatriotIDCard: u8 = 55u8;
pub const THOST_FTDC_ICT_HomeComingCard: u8 = 56u8;
pub const THOST_FTDC_ICT_LicenseNo: u8 = 57u8;
pub const THOST_FTDC_ICT_TaxNo: u8 = 65u8;
pub const THOST_FTDC_ICT_HMMainlandTravelPermit: u8 = 66u8;
pub const THOST_FTDC_ICT_TwMainlandTravelPermit: u8 = 67u8;
pub const THOST_FTDC_ICT_DrivingLicense: u8 = 68u8;
pub const THOST_FTDC_ICT_SocialID: u8 = 70u8;
pub const THOST_FTDC_ICT_LocalID: u8 = 71u8;
pub const THOST_FTDC_ICT_BusinessRegistration: u8 = 72u8;
pub const THOST_FTDC_ICT_HKMCIDCard: u8 = 73u8;
pub const THOST_FTDC_ICT_AccountsPermits: u8 = 74u8;
pub const THOST_FTDC_ICT_FrgPrmtRdCard: u8 = 75u8;
pub const THOST_FTDC_ICT_CptMngPrdLetter: u8 = 76u8;
pub const THOST_FTDC_ICT_HKMCTwResidencePermit: u8 = 77u8;
pub const THOST_FTDC_ICT_UniformSocialCreditCode: u8 = 78u8;
pub const THOST_FTDC_ICT_CorporationCertNo: u8 = 79u8;
pub const THOST_FTDC_ICT_OtherCard: u8 = 120u8;

pub type TThostFtdcSysVersionType = [::std::os::raw::c_char; 41usize];
pub type TThostFtdcOpenLimitControlLevelType = ::std::os::raw::c_char;
pub type TThostFtdcOrderFreqControlLevelType = ::std::os::raw::c_char;
pub type TThostFtdcEnumBoolType = ::std::os::raw::c_char;
pub type TThostFtdcTimeRangeType = ::std::os::raw::c_char;
#[doc = "\nTFtdcDeltaTypeDelta\n"]
pub type TThostFtdcDeltaType = f64;
#[doc = "\nTFtdcSpreadIdType\n"]
pub type TThostFtdcSpreadIdType = ::std::os::raw::c_int;
pub type TThostFtdcPortfolioType = ::std::os::raw::c_char;
#[doc = "\nTFtdcPortfolioDefIDTypeSPBMID\n"]
pub type TThostFtdcPortfolioDefIDType = ::std::os::raw::c_int;
pub type TThostFtdcWithDrawParamIDType = ::std::os::raw::c_char;
#[doc = "\nTFtdcWithDrawParamValueType\n"]
pub type TThostFtdcWithDrawParamValueType = [::std::os::raw::c_char; 41usize];
pub type TThostFtdcInvstTradingRightType = ::std::os::raw::c_char;
#[doc = "\nTFtdcThostFunctionCodeTypeThost\n"]
pub type TThostFtdcThostFunctionCodeType = ::std::os::raw::c_int;
#[doc = "\nTFtdcSPMMDiscountRatioTypeSPMM\n"]
pub type TThostFtdcSPMMDiscountRatioType = f64;
#[doc = "\nTFtdcSPMMModelDescTypeSPMM\n"]
pub type TThostFtdcSPMMModelDescType = [::std::os::raw::c_char; 129usize];
#[doc = "\nTFtdcSPMMModelIDTypeSPMMID\n"]
pub type TThostFtdcSPMMModelIDType = [::std::os::raw::c_char; 33usize];
#[doc = "\nTFtdcSPMMProductIDTypeSPMMID\n"]
pub type TThostFtdcSPMMProductIDType = [::std::os::raw::c_char; 41usize];
pub type TThostFtdcInstMarginCalIDType = ::std::os::raw::c_char;
#[doc = "\nTFtdcProductIDTypeID\n"]
pub type TThostFtdcProductIDType = [::std::os::raw::c_char; 41usize];
#[doc = "\nTFtdcHedgeRateTypeHedgeRate\n"]
pub type TThostFtdcHedgeRateType = f64;
#[doc = "\nTFtdcRCAMSPriorityType\n"]
pub type TThostFtdcRCAMSPriorityType = ::std::os::raw::c_int;
#[doc = "\nTFtdcAdjustValueType\n"]
pub type TThostFtdcAdjustValueType = f64;
pub type TThostFtdcRCAMSCombinationTypeType = ::std::os::raw::c_char;
#[doc = "\nTFtdcRuleIdTypeid\n"]
pub type TThostFtdcRuleIdType = [::std::os::raw::c_char; 51usize];
pub type TThostFtdcPortfTypeType = ::std::os::raw::c_char;
pub type TThostFtdcInstrumentClassType = ::std::os::raw::c_char;
#[doc = "\nTFtdcCommodityGroupIDType\n"]
pub type TThostFtdcCommodityGroupIDType = ::std::os::raw::c_int;
#[doc = "\nTFtdcStdPositionType\n"]
pub type TThostFtdcStdPositionType = f64;
pub type TThostFtdcProdChangeFlagType = ::std::os::raw::c_char;
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcDisseminationField {
    #[doc = ""]
    pub SequenceSeries: TThostFtdcSequenceSeriesType,
    #[doc = ""]
    pub SequenceNo: TThostFtdcSequenceNoType,
}
#[test]
fn bindgen_test_layout_CThostFtdcDisseminationField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcDisseminationField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcDisseminationField>(),
        8usize,
        concat!("Size of: ", stringify!(CThostFtdcDisseminationField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcDisseminationField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcDisseminationField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SequenceSeries) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDisseminationField),
            "::",
            stringify!(SequenceSeries)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SequenceNo) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDisseminationField),
            "::",
            stringify!(SequenceNo)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcReqUserLoginField {
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub Password: TThostFtdcPasswordType,
    #[doc = ""]
    pub UserProductInfo: TThostFtdcProductInfoType,
    #[doc = ""]
    pub InterfaceProductInfo: TThostFtdcProductInfoType,
    #[doc = ""]
    pub ProtocolInfo: TThostFtdcProtocolInfoType,
    #[doc = "Mac"]
    pub MacAddress: TThostFtdcMacAddressType,
    #[doc = ""]
    pub OneTimePassword: TThostFtdcPasswordType,
    #[doc = ""]
    pub reserve1: TThostFtdcOldIPAddressType,
    #[doc = ""]
    pub LoginRemark: TThostFtdcLoginRemarkType,
    #[doc = "IP"]
    pub ClientIPPort: TThostFtdcIPPortType,
    #[doc = "IP"]
    pub ClientIPAddress: TThostFtdcIPAddressType,
}
#[test]
fn bindgen_test_layout_CThostFtdcReqUserLoginField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcReqUserLoginField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcReqUserLoginField>(),
        264usize,
        concat!("Size of: ", stringify!(CThostFtdcReqUserLoginField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcReqUserLoginField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcReqUserLoginField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradingDay) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserID) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Password) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(Password)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserProductInfo) as usize - ptr as usize },
        77usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(UserProductInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InterfaceProductInfo) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(InterfaceProductInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProtocolInfo) as usize - ptr as usize },
        99usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(ProtocolInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MacAddress) as usize - ptr as usize },
        110usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(MacAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OneTimePassword) as usize - ptr as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(OneTimePassword)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve1) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(reserve1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LoginRemark) as usize - ptr as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(LoginRemark)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientIPPort) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(ClientIPPort)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientIPAddress) as usize - ptr as usize },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(ClientIPAddress)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcRspUserLoginField {
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub LoginTime: TThostFtdcTimeType,
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub SystemName: TThostFtdcSystemNameType,
    #[doc = ""]
    pub FrontID: TThostFtdcFrontIDType,
    #[doc = ""]
    pub SessionID: TThostFtdcSessionIDType,
    #[doc = ""]
    pub MaxOrderRef: TThostFtdcOrderRefType,
    #[doc = ""]
    pub SHFETime: TThostFtdcTimeType,
    #[doc = ""]
    pub DCETime: TThostFtdcTimeType,
    #[doc = ""]
    pub CZCETime: TThostFtdcTimeType,
    #[doc = ""]
    pub FFEXTime: TThostFtdcTimeType,
    #[doc = ""]
    pub INETime: TThostFtdcTimeType,
    #[doc = ""]
    pub SysVersion: TThostFtdcSysVersionType,
    #[doc = ""]
    pub GFEXTime: TThostFtdcTimeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcRspUserLoginField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcRspUserLoginField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcRspUserLoginField>(),
        204usize,
        concat!("Size of: ", stringify!(CThostFtdcRspUserLoginField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcRspUserLoginField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcRspUserLoginField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradingDay) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LoginTime) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(LoginTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserID) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SystemName) as usize - ptr as usize },
        45usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(SystemName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FrontID) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(FrontID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SessionID) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(SessionID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MaxOrderRef) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(MaxOrderRef)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SHFETime) as usize - ptr as usize },
        109usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(SHFETime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCETime) as usize - ptr as usize },
        118usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(DCETime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CZCETime) as usize - ptr as usize },
        127usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(CZCETime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FFEXTime) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(FFEXTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).INETime) as usize - ptr as usize },
        145usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(INETime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SysVersion) as usize - ptr as usize },
        154usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(SysVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GFEXTime) as usize - ptr as usize },
        195usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(GFEXTime)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcUserLogoutField {
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcUserLogoutField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcUserLogoutField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcUserLogoutField>(),
        27usize,
        concat!("Size of: ", stringify!(CThostFtdcUserLogoutField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcUserLogoutField>(),
        1usize,
        concat!("Alignment of ", stringify!(CThostFtdcUserLogoutField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcUserLogoutField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserID) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcUserLogoutField),
            "::",
            stringify!(UserID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcForceUserLogoutField {
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcForceUserLogoutField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcForceUserLogoutField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcForceUserLogoutField>(),
        27usize,
        concat!("Size of: ", stringify!(CThostFtdcForceUserLogoutField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcForceUserLogoutField>(),
        1usize,
        concat!("Alignment of ", stringify!(CThostFtdcForceUserLogoutField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcForceUserLogoutField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserID) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcForceUserLogoutField),
            "::",
            stringify!(UserID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcReqAuthenticateField {
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub UserProductInfo: TThostFtdcProductInfoType,
    #[doc = ""]
    pub AuthCode: TThostFtdcAuthCodeType,
    #[doc = "App"]
    pub AppID: TThostFtdcAppIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcReqAuthenticateField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcReqAuthenticateField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcReqAuthenticateField>(),
        88usize,
        concat!("Size of: ", stringify!(CThostFtdcReqAuthenticateField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcReqAuthenticateField>(),
        1usize,
        concat!("Alignment of ", stringify!(CThostFtdcReqAuthenticateField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqAuthenticateField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserID) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqAuthenticateField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserProductInfo) as usize - ptr as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqAuthenticateField),
            "::",
            stringify!(UserProductInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AuthCode) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqAuthenticateField),
            "::",
            stringify!(AuthCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AppID) as usize - ptr as usize },
        55usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqAuthenticateField),
            "::",
            stringify!(AppID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcRspAuthenticateField {
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub UserProductInfo: TThostFtdcProductInfoType,
    #[doc = "App"]
    pub AppID: TThostFtdcAppIDType,
    #[doc = "App"]
    pub AppType: TThostFtdcAppTypeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcRspAuthenticateField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcRspAuthenticateField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcRspAuthenticateField>(),
        72usize,
        concat!("Size of: ", stringify!(CThostFtdcRspAuthenticateField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcRspAuthenticateField>(),
        1usize,
        concat!("Alignment of ", stringify!(CThostFtdcRspAuthenticateField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspAuthenticateField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserID) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspAuthenticateField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserProductInfo) as usize - ptr as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspAuthenticateField),
            "::",
            stringify!(UserProductInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AppID) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspAuthenticateField),
            "::",
            stringify!(AppID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AppType) as usize - ptr as usize },
        71usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspAuthenticateField),
            "::",
            stringify!(AppType)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcAuthenticationInfoField {
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub UserProductInfo: TThostFtdcProductInfoType,
    #[doc = ""]
    pub AuthInfo: TThostFtdcAuthInfoType,
    #[doc = ""]
    pub IsResult: TThostFtdcBoolType,
    #[doc = "App"]
    pub AppID: TThostFtdcAppIDType,
    #[doc = "App"]
    pub AppType: TThostFtdcAppTypeType,
    #[doc = ""]
    pub reserve1: TThostFtdcOldIPAddressType,
    #[doc = "IP"]
    pub ClientIPAddress: TThostFtdcIPAddressType,
}
#[test]
fn bindgen_test_layout_CThostFtdcAuthenticationInfoField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcAuthenticationInfoField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcAuthenticationInfoField>(),
        256usize,
        concat!("Size of: ", stringify!(CThostFtdcAuthenticationInfoField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcAuthenticationInfoField>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcAuthenticationInfoField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcAuthenticationInfoField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserID) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcAuthenticationInfoField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserProductInfo) as usize - ptr as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcAuthenticationInfoField),
            "::",
            stringify!(UserProductInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AuthInfo) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcAuthenticationInfoField),
            "::",
            stringify!(AuthInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsResult) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcAuthenticationInfoField),
            "::",
            stringify!(IsResult)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AppID) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcAuthenticationInfoField),
            "::",
            stringify!(AppID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AppType) as usize - ptr as usize },
        205usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcAuthenticationInfoField),
            "::",
            stringify!(AppType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve1) as usize - ptr as usize },
        206usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcAuthenticationInfoField),
            "::",
            stringify!(reserve1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientIPAddress) as usize - ptr as usize },
        222usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcAuthenticationInfoField),
            "::",
            stringify!(ClientIPAddress)
        )
    );
}
#[doc = "2"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcRspUserLogin2Field {
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub LoginTime: TThostFtdcTimeType,
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub SystemName: TThostFtdcSystemNameType,
    #[doc = ""]
    pub FrontID: TThostFtdcFrontIDType,
    #[doc = ""]
    pub SessionID: TThostFtdcSessionIDType,
    #[doc = ""]
    pub MaxOrderRef: TThostFtdcOrderRefType,
    #[doc = ""]
    pub SHFETime: TThostFtdcTimeType,
    #[doc = ""]
    pub DCETime: TThostFtdcTimeType,
    #[doc = ""]
    pub CZCETime: TThostFtdcTimeType,
    #[doc = ""]
    pub FFEXTime: TThostFtdcTimeType,
    #[doc = ""]
    pub INETime: TThostFtdcTimeType,
    #[doc = ""]
    pub RandomString: TThostFtdcRandomStringType,
}
#[test]
fn bindgen_test_layout_CThostFtdcRspUserLogin2Field() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcRspUserLogin2Field> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcRspUserLogin2Field>(),
        172usize,
        concat!("Size of: ", stringify!(CThostFtdcRspUserLogin2Field))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcRspUserLogin2Field>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcRspUserLogin2Field))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradingDay) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LoginTime) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(LoginTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserID) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SystemName) as usize - ptr as usize },
        45usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(SystemName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FrontID) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(FrontID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SessionID) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(SessionID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MaxOrderRef) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(MaxOrderRef)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SHFETime) as usize - ptr as usize },
        109usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(SHFETime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCETime) as usize - ptr as usize },
        118usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(DCETime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CZCETime) as usize - ptr as usize },
        127usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(CZCETime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FFEXTime) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(FFEXTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).INETime) as usize - ptr as usize },
        145usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(INETime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RandomString) as usize - ptr as usize },
        154usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(RandomString)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTransferHeaderField {
    #[doc = "1.0"]
    pub Version: TThostFtdcVersionType,
    #[doc = ""]
    pub TradeCode: TThostFtdcTradeCodeType,
    #[doc = "yyyymmdd"]
    pub TradeDate: TThostFtdcTradeDateType,
    #[doc = "hhmmss"]
    pub TradeTime: TThostFtdcTradeTimeType,
    #[doc = "N/A"]
    pub TradeSerial: TThostFtdcTradeSerialType,
    #[doc = ""]
    pub FutureID: TThostFtdcFutureIDType,
    #[doc = ""]
    pub BankID: TThostFtdcBankIDType,
    #[doc = ""]
    pub BankBrchID: TThostFtdcBankBrchIDType,
    #[doc = "N/A"]
    pub OperNo: TThostFtdcOperNoType,
    #[doc = "N/A"]
    pub DeviceID: TThostFtdcDeviceIDType,
    #[doc = "N/A"]
    pub RecordNum: TThostFtdcRecordNumType,
    #[doc = "N/A"]
    pub SessionID: TThostFtdcSessionIDType,
    #[doc = "N/A"]
    pub RequestID: TThostFtdcRequestIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTransferHeaderField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcTransferHeaderField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTransferHeaderField>(),
        96usize,
        concat!("Size of: ", stringify!(CThostFtdcTransferHeaderField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTransferHeaderField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcTransferHeaderField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradeCode) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(TradeCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradeDate) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(TradeDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradeTime) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(TradeTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradeSerial) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(TradeSerial)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FutureID) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(FutureID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BankID) as usize - ptr as usize },
        49usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(BankID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BankBrchID) as usize - ptr as usize },
        53usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(BankBrchID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OperNo) as usize - ptr as usize },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(OperNo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DeviceID) as usize - ptr as usize },
        75usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(DeviceID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RecordNum) as usize - ptr as usize },
        78usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(RecordNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SessionID) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(SessionID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RequestID) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(RequestID)
        )
    );
}
#[doc = "TradeCode=202001"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTransferBankToFutureReqField {
    #[doc = ""]
    pub FutureAccount: TThostFtdcAccountIDType,
    #[doc = ""]
    pub FuturePwdFlag: TThostFtdcFuturePwdFlagType,
    #[doc = ""]
    pub FutureAccPwd: TThostFtdcFutureAccPwdType,
    #[doc = ""]
    pub TradeAmt: TThostFtdcMoneyType,
    #[doc = ""]
    pub CustFee: TThostFtdcMoneyType,
    #[doc = "RMB- USD- HKD-"]
    pub CurrencyCode: TThostFtdcCurrencyCodeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTransferBankToFutureReqField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcTransferBankToFutureReqField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTransferBankToFutureReqField>(),
        56usize,
        concat!(
            "Size of: ",
            stringify!(CThostFtdcTransferBankToFutureReqField)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTransferBankToFutureReqField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcTransferBankToFutureReqField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FutureAccount) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureReqField),
            "::",
            stringify!(FutureAccount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FuturePwdFlag) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureReqField),
            "::",
            stringify!(FuturePwdFlag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FutureAccPwd) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureReqField),
            "::",
            stringify!(FutureAccPwd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradeAmt) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureReqField),
            "::",
            stringify!(TradeAmt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CustFee) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureReqField),
            "::",
            stringify!(CustFee)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrencyCode) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureReqField),
            "::",
            stringify!(CurrencyCode)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTransferBankToFutureRspField {
    #[doc = ""]
    pub RetCode: TThostFtdcRetCodeType,
    #[doc = ""]
    pub RetInfo: TThostFtdcRetInfoType,
    #[doc = ""]
    pub FutureAccount: TThostFtdcAccountIDType,
    #[doc = ""]
    pub TradeAmt: TThostFtdcMoneyType,
    #[doc = ""]
    pub CustFee: TThostFtdcMoneyType,
    #[doc = ""]
    pub CurrencyCode: TThostFtdcCurrencyCodeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTransferBankToFutureRspField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcTransferBankToFutureRspField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTransferBankToFutureRspField>(),
        176usize,
        concat!(
            "Size of: ",
            stringify!(CThostFtdcTransferBankToFutureRspField)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTransferBankToFutureRspField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcTransferBankToFutureRspField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RetCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureRspField),
            "::",
            stringify!(RetCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RetInfo) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureRspField),
            "::",
            stringify!(RetInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FutureAccount) as usize - ptr as usize },
        134usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureRspField),
            "::",
            stringify!(FutureAccount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradeAmt) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureRspField),
            "::",
            stringify!(TradeAmt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CustFee) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureRspField),
            "::",
            stringify!(CustFee)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrencyCode) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureRspField),
            "::",
            stringify!(CurrencyCode)
        )
    );
}
#[doc = "TradeCode=202002"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTransferFutureToBankReqField {
    #[doc = ""]
    pub FutureAccount: TThostFtdcAccountIDType,
    #[doc = ""]
    pub FuturePwdFlag: TThostFtdcFuturePwdFlagType,
    #[doc = ""]
    pub FutureAccPwd: TThostFtdcFutureAccPwdType,
    #[doc = ""]
    pub TradeAmt: TThostFtdcMoneyType,
    #[doc = ""]
    pub CustFee: TThostFtdcMoneyType,
    #[doc = "RMB- USD- HKD-"]
    pub CurrencyCode: TThostFtdcCurrencyCodeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTransferFutureToBankReqField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcTransferFutureToBankReqField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTransferFutureToBankReqField>(),
        56usize,
        concat!(
            "Size of: ",
            stringify!(CThostFtdcTransferFutureToBankReqField)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTransferFutureToBankReqField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcTransferFutureToBankReqField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FutureAccount) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankReqField),
            "::",
            stringify!(FutureAccount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FuturePwdFlag) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankReqField),
            "::",
            stringify!(FuturePwdFlag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FutureAccPwd) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankReqField),
            "::",
            stringify!(FutureAccPwd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradeAmt) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankReqField),
            "::",
            stringify!(TradeAmt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CustFee) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankReqField),
            "::",
            stringify!(CustFee)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrencyCode) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankReqField),
            "::",
            stringify!(CurrencyCode)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTransferFutureToBankRspField {
    #[doc = ""]
    pub RetCode: TThostFtdcRetCodeType,
    #[doc = ""]
    pub RetInfo: TThostFtdcRetInfoType,
    #[doc = ""]
    pub FutureAccount: TThostFtdcAccountIDType,
    #[doc = ""]
    pub TradeAmt: TThostFtdcMoneyType,
    #[doc = ""]
    pub CustFee: TThostFtdcMoneyType,
    #[doc = ""]
    pub CurrencyCode: TThostFtdcCurrencyCodeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTransferFutureToBankRspField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcTransferFutureToBankRspField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTransferFutureToBankRspField>(),
        176usize,
        concat!(
            "Size of: ",
            stringify!(CThostFtdcTransferFutureToBankRspField)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTransferFutureToBankRspField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcTransferFutureToBankRspField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RetCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankRspField),
            "::",
            stringify!(RetCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RetInfo) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankRspField),
            "::",
            stringify!(RetInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FutureAccount) as usize - ptr as usize },
        134usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankRspField),
            "::",
            stringify!(FutureAccount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradeAmt) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankRspField),
            "::",
            stringify!(TradeAmt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CustFee) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankRspField),
            "::",
            stringify!(CustFee)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrencyCode) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankRspField),
            "::",
            stringify!(CurrencyCode)
        )
    );
}
#[doc = "TradeCode=204002"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTransferQryBankReqField {
    #[doc = ""]
    pub FutureAccount: TThostFtdcAccountIDType,
    #[doc = ""]
    pub FuturePwdFlag: TThostFtdcFuturePwdFlagType,
    #[doc = ""]
    pub FutureAccPwd: TThostFtdcFutureAccPwdType,
    #[doc = "RMB- USD- HKD-"]
    pub CurrencyCode: TThostFtdcCurrencyCodeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTransferQryBankReqField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcTransferQryBankReqField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTransferQryBankReqField>(),
        35usize,
        concat!("Size of: ", stringify!(CThostFtdcTransferQryBankReqField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTransferQryBankReqField>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcTransferQryBankReqField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FutureAccount) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankReqField),
            "::",
            stringify!(FutureAccount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FuturePwdFlag) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankReqField),
            "::",
            stringify!(FuturePwdFlag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FutureAccPwd) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankReqField),
            "::",
            stringify!(FutureAccPwd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrencyCode) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankReqField),
            "::",
            stringify!(CurrencyCode)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTransferQryBankRspField {
    #[doc = ""]
    pub RetCode: TThostFtdcRetCodeType,
    #[doc = ""]
    pub RetInfo: TThostFtdcRetInfoType,
    #[doc = ""]
    pub FutureAccount: TThostFtdcAccountIDType,
    #[doc = ""]
    pub TradeAmt: TThostFtdcMoneyType,
    #[doc = ""]
    pub UseAmt: TThostFtdcMoneyType,
    #[doc = ""]
    pub FetchAmt: TThostFtdcMoneyType,
    #[doc = ""]
    pub CurrencyCode: TThostFtdcCurrencyCodeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTransferQryBankRspField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcTransferQryBankRspField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTransferQryBankRspField>(),
        184usize,
        concat!("Size of: ", stringify!(CThostFtdcTransferQryBankRspField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTransferQryBankRspField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcTransferQryBankRspField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RetCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankRspField),
            "::",
            stringify!(RetCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RetInfo) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankRspField),
            "::",
            stringify!(RetInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FutureAccount) as usize - ptr as usize },
        134usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankRspField),
            "::",
            stringify!(FutureAccount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradeAmt) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankRspField),
            "::",
            stringify!(TradeAmt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UseAmt) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankRspField),
            "::",
            stringify!(UseAmt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FetchAmt) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankRspField),
            "::",
            stringify!(FetchAmt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrencyCode) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankRspField),
            "::",
            stringify!(CurrencyCode)
        )
    );
}
#[doc = "TradeCode=204999"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTransferQryDetailReqField {
    #[doc = ""]
    pub FutureAccount: TThostFtdcAccountIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTransferQryDetailReqField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcTransferQryDetailReqField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTransferQryDetailReqField>(),
        13usize,
        concat!("Size of: ", stringify!(CThostFtdcTransferQryDetailReqField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTransferQryDetailReqField>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcTransferQryDetailReqField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FutureAccount) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailReqField),
            "::",
            stringify!(FutureAccount)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTransferQryDetailRspField {
    #[doc = ""]
    pub TradeDate: TThostFtdcDateType,
    #[doc = ""]
    pub TradeTime: TThostFtdcTradeTimeType,
    #[doc = ""]
    pub TradeCode: TThostFtdcTradeCodeType,
    #[doc = ""]
    pub FutureSerial: TThostFtdcTradeSerialNoType,
    #[doc = ""]
    pub FutureID: TThostFtdcFutureIDType,
    #[doc = ""]
    pub FutureAccount: TThostFtdcFutureAccountType,
    #[doc = ""]
    pub BankSerial: TThostFtdcTradeSerialNoType,
    #[doc = ""]
    pub BankID: TThostFtdcBankIDType,
    #[doc = ""]
    pub BankBrchID: TThostFtdcBankBrchIDType,
    #[doc = ""]
    pub BankAccount: TThostFtdcBankAccountType,
    #[doc = ""]
    pub CertCode: TThostFtdcCertCodeType,
    #[doc = ""]
    pub CurrencyCode: TThostFtdcCurrencyCodeType,
    #[doc = ""]
    pub TxAmount: TThostFtdcMoneyType,
    #[doc = ""]
    pub Flag: TThostFtdcTransferValidFlagType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTransferQryDetailRspField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcTransferQryDetailRspField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTransferQryDetailRspField>(),
        168usize,
        concat!("Size of: ", stringify!(CThostFtdcTransferQryDetailRspField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTransferQryDetailRspField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcTransferQryDetailRspField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradeDate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(TradeDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradeTime) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(TradeTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradeCode) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(TradeCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FutureSerial) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(FutureSerial)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FutureID) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(FutureID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FutureAccount) as usize - ptr as usize },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(FutureAccount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BankSerial) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(BankSerial)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BankID) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(BankID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BankBrchID) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(BankBrchID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BankAccount) as usize - ptr as usize },
        81usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(BankAccount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CertCode) as usize - ptr as usize },
        122usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(CertCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrencyCode) as usize - ptr as usize },
        143usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(CurrencyCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TxAmount) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(TxAmount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Flag) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(Flag)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcRspInfoField {
    #[doc = ""]
    pub ErrorID: TThostFtdcErrorIDType,
    #[doc = ""]
    pub ErrorMsg: TThostFtdcErrorMsgType,
}
#[test]
fn bindgen_test_layout_CThostFtdcRspInfoField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcRspInfoField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcRspInfoField>(),
        88usize,
        concat!("Size of: ", stringify!(CThostFtdcRspInfoField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcRspInfoField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcRspInfoField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ErrorID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspInfoField),
            "::",
            stringify!(ErrorID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ErrorMsg) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspInfoField),
            "::",
            stringify!(ErrorMsg)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcExchangeField {
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub ExchangeName: TThostFtdcExchangeNameType,
    #[doc = ""]
    pub ExchangeProperty: TThostFtdcExchangePropertyType,
}
#[test]
fn bindgen_test_layout_CThostFtdcExchangeField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcExchangeField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcExchangeField>(),
        71usize,
        concat!("Size of: ", stringify!(CThostFtdcExchangeField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcExchangeField>(),
        1usize,
        concat!("Alignment of ", stringify!(CThostFtdcExchangeField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeName) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeField),
            "::",
            stringify!(ExchangeName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeProperty) as usize - ptr as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeField),
            "::",
            stringify!(ExchangeProperty)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcProductField {
    #[doc = ""]
    pub reserve1: TThostFtdcOldInstrumentIDType,
    #[doc = ""]
    pub ProductName: TThostFtdcProductNameType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub ProductClass: TThostFtdcProductClassType,
    #[doc = ""]
    pub VolumeMultiple: TThostFtdcVolumeMultipleType,
    #[doc = ""]
    pub PriceTick: TThostFtdcPriceType,
    #[doc = ""]
    pub MaxMarketOrderVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub MinMarketOrderVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub MaxLimitOrderVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub MinLimitOrderVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub PositionType: TThostFtdcPositionTypeType,
    #[doc = ""]
    pub PositionDateType: TThostFtdcPositionDateTypeType,
    #[doc = ""]
    pub CloseDealType: TThostFtdcCloseDealTypeType,
    #[doc = ""]
    pub TradeCurrencyID: TThostFtdcCurrencyIDType,
    #[doc = ""]
    pub MortgageFundUseRange: TThostFtdcMortgageFundUseRangeType,
    #[doc = ""]
    pub reserve2: TThostFtdcOldInstrumentIDType,
    #[doc = ""]
    pub UnderlyingMultiple: TThostFtdcUnderlyingMultipleType,
    #[doc = ""]
    pub ProductID: TThostFtdcInstrumentIDType,
    #[doc = ""]
    pub ExchangeProductID: TThostFtdcInstrumentIDType,
    #[doc = ""]
    pub OpenLimitControlLevel: TThostFtdcOpenLimitControlLevelType,
    #[doc = ""]
    pub OrderFreqControlLevel: TThostFtdcOrderFreqControlLevelType,
}
#[test]
fn bindgen_test_layout_CThostFtdcProductField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcProductField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcProductField>(),
        312usize,
        concat!("Size of: ", stringify!(CThostFtdcProductField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcProductField>(),
        8usize,
        concat!("Alignment of ", stringify!(CThostFtdcProductField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(reserve1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProductName) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(ProductName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeID) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProductClass) as usize - ptr as usize },
        61usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(ProductClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VolumeMultiple) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(VolumeMultiple)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PriceTick) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(PriceTick)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MaxMarketOrderVolume) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(MaxMarketOrderVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinMarketOrderVolume) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(MinMarketOrderVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MaxLimitOrderVolume) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(MaxLimitOrderVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinLimitOrderVolume) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(MinLimitOrderVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PositionType) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(PositionType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PositionDateType) as usize - ptr as usize },
        97usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(PositionDateType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CloseDealType) as usize - ptr as usize },
        98usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(CloseDealType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradeCurrencyID) as usize - ptr as usize },
        99usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(TradeCurrencyID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MortgageFundUseRange) as usize - ptr as usize },
        103usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(MortgageFundUseRange)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve2) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(reserve2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UnderlyingMultiple) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(UnderlyingMultiple)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProductID) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(ProductID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeProductID) as usize - ptr as usize },
        225usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(ExchangeProductID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OpenLimitControlLevel) as usize - ptr as usize },
        306usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(OpenLimitControlLevel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderFreqControlLevel) as usize - ptr as usize },
        307usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(OrderFreqControlLevel)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcInstrumentField {
    #[doc = ""]
    pub reserve1: TThostFtdcOldInstrumentIDType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub InstrumentName: TThostFtdcInstrumentNameType,
    #[doc = ""]
    pub reserve2: TThostFtdcOldExchangeInstIDType,
    #[doc = ""]
    pub reserve3: TThostFtdcOldInstrumentIDType,
    #[doc = ""]
    pub ProductClass: TThostFtdcProductClassType,
    #[doc = ""]
    pub DeliveryYear: TThostFtdcYearType,
    #[doc = ""]
    pub DeliveryMonth: TThostFtdcMonthType,
    #[doc = ""]
    pub MaxMarketOrderVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub MinMarketOrderVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub MaxLimitOrderVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub MinLimitOrderVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub VolumeMultiple: TThostFtdcVolumeMultipleType,
    #[doc = ""]
    pub PriceTick: TThostFtdcPriceType,
    #[doc = ""]
    pub CreateDate: TThostFtdcDateType,
    #[doc = ""]
    pub OpenDate: TThostFtdcDateType,
    #[doc = ""]
    pub ExpireDate: TThostFtdcDateType,
    #[doc = ""]
    pub StartDelivDate: TThostFtdcDateType,
    #[doc = ""]
    pub EndDelivDate: TThostFtdcDateType,
    #[doc = ""]
    pub InstLifePhase: TThostFtdcInstLifePhaseType,
    #[doc = ""]
    pub IsTrading: TThostFtdcBoolType,
    #[doc = ""]
    pub PositionType: TThostFtdcPositionTypeType,
    #[doc = ""]
    pub PositionDateType: TThostFtdcPositionDateTypeType,
    #[doc = ""]
    pub LongMarginRatio: TThostFtdcRatioType,
    #[doc = ""]
    pub ShortMarginRatio: TThostFtdcRatioType,
    #[doc = ""]
    pub MaxMarginSideAlgorithm: TThostFtdcMaxMarginSideAlgorithmType,
    #[doc = ""]
    pub reserve4: TThostFtdcOldInstrumentIDType,
    #[doc = ""]
    pub StrikePrice: TThostFtdcPriceType,
    #[doc = ""]
    pub OptionsType: TThostFtdcOptionsTypeType,
    #[doc = ""]
    pub UnderlyingMultiple: TThostFtdcUnderlyingMultipleType,
    #[doc = ""]
    pub CombinationType: TThostFtdcCombinationTypeType,
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
    #[doc = ""]
    pub ExchangeInstID: TThostFtdcExchangeInstIDType,
    #[doc = ""]
    pub ProductID: TThostFtdcInstrumentIDType,
    #[doc = ""]
    pub UnderlyingInstrID: TThostFtdcInstrumentIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcInstrumentField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcInstrumentField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcInstrumentField>(),
        616usize,
        concat!("Size of: ", stringify!(CThostFtdcInstrumentField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcInstrumentField>(),
        8usize,
        concat!("Alignment of ", stringify!(CThostFtdcInstrumentField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(reserve1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeID) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InstrumentName) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(InstrumentName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve2) as usize - ptr as usize },
        61usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(reserve2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve3) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(reserve3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProductClass) as usize - ptr as usize },
        123usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(ProductClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DeliveryYear) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(DeliveryYear)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DeliveryMonth) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(DeliveryMonth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MaxMarketOrderVolume) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(MaxMarketOrderVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinMarketOrderVolume) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(MinMarketOrderVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MaxLimitOrderVolume) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(MaxLimitOrderVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinLimitOrderVolume) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(MinLimitOrderVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VolumeMultiple) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(VolumeMultiple)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PriceTick) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(PriceTick)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CreateDate) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(CreateDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OpenDate) as usize - ptr as usize },
        169usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(OpenDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExpireDate) as usize - ptr as usize },
        178usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(ExpireDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).StartDelivDate) as usize - ptr as usize },
        187usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(StartDelivDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EndDelivDate) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(EndDelivDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InstLifePhase) as usize - ptr as usize },
        205usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(InstLifePhase)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsTrading) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(IsTrading)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PositionType) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(PositionType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PositionDateType) as usize - ptr as usize },
        213usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(PositionDateType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LongMarginRatio) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(LongMarginRatio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ShortMarginRatio) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(ShortMarginRatio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MaxMarginSideAlgorithm) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(MaxMarginSideAlgorithm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve4) as usize - ptr as usize },
        233usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(reserve4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).StrikePrice) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(StrikePrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OptionsType) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(OptionsType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UnderlyingMultiple) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(UnderlyingMultiple)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CombinationType) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(CombinationType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InstrumentID) as usize - ptr as usize },
        289usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(InstrumentID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeInstID) as usize - ptr as usize },
        370usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(ExchangeInstID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProductID) as usize - ptr as usize },
        451usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(ProductID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UnderlyingInstrID) as usize - ptr as usize },
        532usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(UnderlyingInstrID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcBrokerField {
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub BrokerAbbr: TThostFtdcBrokerAbbrType,
    #[doc = ""]
    pub BrokerName: TThostFtdcBrokerNameType,
    #[doc = ""]
    pub IsActive: TThostFtdcBoolType,
}
#[test]
fn bindgen_test_layout_CThostFtdcBrokerField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcBrokerField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcBrokerField>(),
        108usize,
        concat!("Size of: ", stringify!(CThostFtdcBrokerField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcBrokerField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcBrokerField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerAbbr) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerField),
            "::",
            stringify!(BrokerAbbr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerName) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerField),
            "::",
            stringify!(BrokerName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsActive) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerField),
            "::",
            stringify!(IsActive)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTraderField {
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub TraderID: TThostFtdcTraderIDType,
    #[doc = ""]
    pub ParticipantID: TThostFtdcParticipantIDType,
    #[doc = ""]
    pub Password: TThostFtdcPasswordType,
    #[doc = ""]
    pub InstallCount: TThostFtdcInstallCountType,
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub OrderCancelAlg: TThostFtdcOrderCancelAlgType,
    #[doc = ""]
    pub TradeInstallCount: TThostFtdcInstallCountType,
    #[doc = ""]
    pub MDInstallCount: TThostFtdcInstallCountType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTraderField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcTraderField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTraderField>(),
        108usize,
        concat!("Size of: ", stringify!(CThostFtdcTraderField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTraderField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcTraderField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TraderID) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderField),
            "::",
            stringify!(TraderID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ParticipantID) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderField),
            "::",
            stringify!(ParticipantID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Password) as usize - ptr as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderField),
            "::",
            stringify!(Password)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InstallCount) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderField),
            "::",
            stringify!(InstallCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderCancelAlg) as usize - ptr as usize },
        99usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderField),
            "::",
            stringify!(OrderCancelAlg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradeInstallCount) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderField),
            "::",
            stringify!(TradeInstallCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MDInstallCount) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderField),
            "::",
            stringify!(MDInstallCount)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcInvestorField {
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorGroupID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub InvestorName: TThostFtdcPartyNameType,
    #[doc = ""]
    pub IdentifiedCardType: TThostFtdcIdCardTypeType,
    #[doc = ""]
    pub IdentifiedCardNo: TThostFtdcIdentifiedCardNoType,
    #[doc = ""]
    pub IsActive: TThostFtdcBoolType,
    #[doc = ""]
    pub Telephone: TThostFtdcTelephoneType,
    #[doc = ""]
    pub Address: TThostFtdcAddressType,
    #[doc = ""]
    pub OpenDate: TThostFtdcDateType,
    #[doc = ""]
    pub Mobile: TThostFtdcMobileType,
    #[doc = ""]
    pub CommModelID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub MarginModelID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub IsOrderFreq: TThostFtdcEnumBoolType,
    #[doc = ""]
    pub IsOpenVolLimit: TThostFtdcEnumBoolType,
}
#[test]
fn bindgen_test_layout_CThostFtdcInvestorField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcInvestorField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcInvestorField>(),
        396usize,
        concat!("Size of: ", stringify!(CThostFtdcInvestorField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcInvestorField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcInvestorField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestorID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestorGroupID) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(InvestorGroupID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestorName) as usize - ptr as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(InvestorName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IdentifiedCardType) as usize - ptr as usize },
        118usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(IdentifiedCardType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IdentifiedCardNo) as usize - ptr as usize },
        119usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(IdentifiedCardNo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsActive) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(IsActive)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Telephone) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(Telephone)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Address) as usize - ptr as usize },
        217usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(Address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OpenDate) as usize - ptr as usize },
        318usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(OpenDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Mobile) as usize - ptr as usize },
        327usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(Mobile)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CommModelID) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(CommModelID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MarginModelID) as usize - ptr as usize },
        381usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(MarginModelID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsOrderFreq) as usize - ptr as usize },
        394usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(IsOrderFreq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsOpenVolLimit) as usize - ptr as usize },
        395usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(IsOpenVolLimit)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTradingCodeField {
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub ClientID: TThostFtdcClientIDType,
    #[doc = ""]
    pub IsActive: TThostFtdcBoolType,
    #[doc = ""]
    pub ClientIDType: TThostFtdcClientIDTypeType,
    #[doc = ""]
    pub BranchID: TThostFtdcBranchIDType,
    #[doc = ""]
    pub BizType: TThostFtdcBizTypeType,
    #[doc = ""]
    pub InvestUnitID: TThostFtdcInvestUnitIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTradingCodeField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcTradingCodeField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTradingCodeField>(),
        76usize,
        concat!("Size of: ", stringify!(CThostFtdcTradingCodeField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTradingCodeField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcTradingCodeField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestorID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingCodeField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingCodeField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeID) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingCodeField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientID) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingCodeField),
            "::",
            stringify!(ClientID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsActive) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingCodeField),
            "::",
            stringify!(IsActive)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientIDType) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingCodeField),
            "::",
            stringify!(ClientIDType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BranchID) as usize - ptr as usize },
        49usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingCodeField),
            "::",
            stringify!(BranchID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BizType) as usize - ptr as usize },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingCodeField),
            "::",
            stringify!(BizType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestUnitID) as usize - ptr as usize },
        59usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingCodeField),
            "::",
            stringify!(InvestUnitID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcPartBrokerField {
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub ParticipantID: TThostFtdcParticipantIDType,
    #[doc = ""]
    pub IsActive: TThostFtdcBoolType,
}
#[test]
fn bindgen_test_layout_CThostFtdcPartBrokerField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcPartBrokerField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcPartBrokerField>(),
        36usize,
        concat!("Size of: ", stringify!(CThostFtdcPartBrokerField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcPartBrokerField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcPartBrokerField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcPartBrokerField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeID) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcPartBrokerField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ParticipantID) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcPartBrokerField),
            "::",
            stringify!(ParticipantID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsActive) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcPartBrokerField),
            "::",
            stringify!(IsActive)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcSuperUserField {
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub UserName: TThostFtdcUserNameType,
    #[doc = ""]
    pub Password: TThostFtdcPasswordType,
    #[doc = ""]
    pub IsActive: TThostFtdcBoolType,
}
#[test]
fn bindgen_test_layout_CThostFtdcSuperUserField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcSuperUserField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcSuperUserField>(),
        144usize,
        concat!("Size of: ", stringify!(CThostFtdcSuperUserField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcSuperUserField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcSuperUserField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSuperUserField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserName) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSuperUserField),
            "::",
            stringify!(UserName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Password) as usize - ptr as usize },
        97usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSuperUserField),
            "::",
            stringify!(Password)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsActive) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSuperUserField),
            "::",
            stringify!(IsActive)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcSuperUserFunctionField {
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub FunctionCode: TThostFtdcFunctionCodeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcSuperUserFunctionField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcSuperUserFunctionField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcSuperUserFunctionField>(),
        17usize,
        concat!("Size of: ", stringify!(CThostFtdcSuperUserFunctionField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcSuperUserFunctionField>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcSuperUserFunctionField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSuperUserFunctionField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FunctionCode) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSuperUserFunctionField),
            "::",
            stringify!(FunctionCode)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcInvestorGroupField {
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorGroupID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub InvestorGroupName: TThostFtdcInvestorGroupNameType,
}
#[test]
fn bindgen_test_layout_CThostFtdcInvestorGroupField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcInvestorGroupField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcInvestorGroupField>(),
        65usize,
        concat!("Size of: ", stringify!(CThostFtdcInvestorGroupField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcInvestorGroupField>(),
        1usize,
        concat!("Alignment of ", stringify!(CThostFtdcInvestorGroupField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorGroupField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestorGroupID) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorGroupField),
            "::",
            stringify!(InvestorGroupID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestorGroupName) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorGroupField),
            "::",
            stringify!(InvestorGroupName)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTradingAccountField {
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub AccountID: TThostFtdcAccountIDType,
    #[doc = ""]
    pub PreMortgage: TThostFtdcMoneyType,
    #[doc = ""]
    pub PreCredit: TThostFtdcMoneyType,
    #[doc = ""]
    pub PreDeposit: TThostFtdcMoneyType,
    #[doc = ""]
    pub PreBalance: TThostFtdcMoneyType,
    #[doc = ""]
    pub PreMargin: TThostFtdcMoneyType,
    #[doc = ""]
    pub InterestBase: TThostFtdcMoneyType,
    #[doc = ""]
    pub Interest: TThostFtdcMoneyType,
    #[doc = ""]
    pub Deposit: TThostFtdcMoneyType,
    #[doc = ""]
    pub Withdraw: TThostFtdcMoneyType,
    #[doc = ""]
    pub FrozenMargin: TThostFtdcMoneyType,
    #[doc = ""]
    pub FrozenCash: TThostFtdcMoneyType,
    #[doc = ""]
    pub FrozenCommission: TThostFtdcMoneyType,
    #[doc = ""]
    pub CurrMargin: TThostFtdcMoneyType,
    #[doc = ""]
    pub CashIn: TThostFtdcMoneyType,
    #[doc = ""]
    pub Commission: TThostFtdcMoneyType,
    #[doc = ""]
    pub CloseProfit: TThostFtdcMoneyType,
    #[doc = ""]
    pub PositionProfit: TThostFtdcMoneyType,
    #[doc = ""]
    pub Balance: TThostFtdcMoneyType,
    #[doc = ""]
    pub Available: TThostFtdcMoneyType,
    #[doc = ""]
    pub WithdrawQuota: TThostFtdcMoneyType,
    #[doc = ""]
    pub Reserve: TThostFtdcMoneyType,
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub SettlementID: TThostFtdcSettlementIDType,
    #[doc = ""]
    pub Credit: TThostFtdcMoneyType,
    #[doc = ""]
    pub Mortgage: TThostFtdcMoneyType,
    #[doc = ""]
    pub ExchangeMargin: TThostFtdcMoneyType,
    #[doc = ""]
    pub DeliveryMargin: TThostFtdcMoneyType,
    #[doc = ""]
    pub ExchangeDeliveryMargin: TThostFtdcMoneyType,
    #[doc = ""]
    pub ReserveBalance: TThostFtdcMoneyType,
    #[doc = ""]
    pub CurrencyID: TThostFtdcCurrencyIDType,
    #[doc = ""]
    pub PreFundMortgageIn: TThostFtdcMoneyType,
    #[doc = ""]
    pub PreFundMortgageOut: TThostFtdcMoneyType,
    #[doc = ""]
    pub FundMortgageIn: TThostFtdcMoneyType,
    #[doc = ""]
    pub FundMortgageOut: TThostFtdcMoneyType,
    #[doc = ""]
    pub FundMortgageAvailable: TThostFtdcMoneyType,
    #[doc = ""]
    pub MortgageableFund: TThostFtdcMoneyType,
    #[doc = ""]
    pub SpecProductMargin: TThostFtdcMoneyType,
    #[doc = ""]
    pub SpecProductFrozenMargin: TThostFtdcMoneyType,
    #[doc = ""]
    pub SpecProductCommission: TThostFtdcMoneyType,
    #[doc = ""]
    pub SpecProductFrozenCommission: TThostFtdcMoneyType,
    #[doc = ""]
    pub SpecProductPositionProfit: TThostFtdcMoneyType,
    #[doc = ""]
    pub SpecProductCloseProfit: TThostFtdcMoneyType,
    #[doc = ""]
    pub SpecProductPositionProfitByAlg: TThostFtdcMoneyType,
    #[doc = ""]
    pub SpecProductExchangeMargin: TThostFtdcMoneyType,
    #[doc = ""]
    pub BizType: TThostFtdcBizTypeType,
    #[doc = ""]
    pub FrozenSwap: TThostFtdcMoneyType,
    #[doc = ""]
    pub RemainSwap: TThostFtdcMoneyType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTradingAccountField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcTradingAccountField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTradingAccountField>(),
        400usize,
        concat!("Size of: ", stringify!(CThostFtdcTradingAccountField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTradingAccountField>(),
        8usize,
        concat!("Alignment of ", stringify!(CThostFtdcTradingAccountField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AccountID) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(AccountID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreMortgage) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(PreMortgage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreCredit) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(PreCredit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreDeposit) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(PreDeposit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreBalance) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(PreBalance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreMargin) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(PreMargin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InterestBase) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(InterestBase)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Interest) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(Interest)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Deposit) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(Deposit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Withdraw) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(Withdraw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FrozenMargin) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(FrozenMargin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FrozenCash) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(FrozenCash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FrozenCommission) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(FrozenCommission)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrMargin) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(CurrMargin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CashIn) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(CashIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Commission) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(Commission)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CloseProfit) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(CloseProfit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PositionProfit) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(PositionProfit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Balance) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(Balance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Available) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(Available)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).WithdrawQuota) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(WithdrawQuota)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Reserve) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(Reserve)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradingDay) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SettlementID) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(SettlementID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Credit) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(Credit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Mortgage) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(Mortgage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeMargin) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(ExchangeMargin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DeliveryMargin) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(DeliveryMargin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeDeliveryMargin) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(ExchangeDeliveryMargin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReserveBalance) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(ReserveBalance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrencyID) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(CurrencyID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreFundMortgageIn) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(PreFundMortgageIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreFundMortgageOut) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(PreFundMortgageOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FundMortgageIn) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(FundMortgageIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FundMortgageOut) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(FundMortgageOut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FundMortgageAvailable) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(FundMortgageAvailable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MortgageableFund) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(MortgageableFund)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SpecProductMargin) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(SpecProductMargin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SpecProductFrozenMargin) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(SpecProductFrozenMargin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SpecProductCommission) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(SpecProductCommission)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SpecProductFrozenCommission) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(SpecProductFrozenCommission)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SpecProductPositionProfit) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(SpecProductPositionProfit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SpecProductCloseProfit) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(SpecProductCloseProfit)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).SpecProductPositionProfitByAlg) as usize - ptr as usize
        },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(SpecProductPositionProfitByAlg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SpecProductExchangeMargin) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(SpecProductExchangeMargin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BizType) as usize - ptr as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(BizType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FrozenSwap) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(FrozenSwap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RemainSwap) as usize - ptr as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(RemainSwap)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcInvestorPositionField {
    #[doc = ""]
    pub reserve1: TThostFtdcOldInstrumentIDType,
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub PosiDirection: TThostFtdcPosiDirectionType,
    #[doc = ""]
    pub HedgeFlag: TThostFtdcHedgeFlagType,
    #[doc = ""]
    pub PositionDate: TThostFtdcPositionDateType,
    #[doc = ""]
    pub YdPosition: TThostFtdcVolumeType,
    #[doc = ""]
    pub Position: TThostFtdcVolumeType,
    #[doc = ""]
    pub LongFrozen: TThostFtdcVolumeType,
    #[doc = ""]
    pub ShortFrozen: TThostFtdcVolumeType,
    #[doc = ""]
    pub LongFrozenAmount: TThostFtdcMoneyType,
    #[doc = ""]
    pub ShortFrozenAmount: TThostFtdcMoneyType,
    #[doc = ""]
    pub OpenVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub CloseVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub OpenAmount: TThostFtdcMoneyType,
    #[doc = ""]
    pub CloseAmount: TThostFtdcMoneyType,
    #[doc = ""]
    pub PositionCost: TThostFtdcMoneyType,
    #[doc = ""]
    pub PreMargin: TThostFtdcMoneyType,
    #[doc = ""]
    pub UseMargin: TThostFtdcMoneyType,
    #[doc = ""]
    pub FrozenMargin: TThostFtdcMoneyType,
    #[doc = ""]
    pub FrozenCash: TThostFtdcMoneyType,
    #[doc = ""]
    pub FrozenCommission: TThostFtdcMoneyType,
    #[doc = ""]
    pub CashIn: TThostFtdcMoneyType,
    #[doc = ""]
    pub Commission: TThostFtdcMoneyType,
    #[doc = ""]
    pub CloseProfit: TThostFtdcMoneyType,
    #[doc = ""]
    pub PositionProfit: TThostFtdcMoneyType,
    #[doc = ""]
    pub PreSettlementPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub SettlementPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub SettlementID: TThostFtdcSettlementIDType,
    #[doc = ""]
    pub OpenCost: TThostFtdcMoneyType,
    #[doc = ""]
    pub ExchangeMargin: TThostFtdcMoneyType,
    #[doc = ""]
    pub CombPosition: TThostFtdcVolumeType,
    #[doc = ""]
    pub CombLongFrozen: TThostFtdcVolumeType,
    #[doc = ""]
    pub CombShortFrozen: TThostFtdcVolumeType,
    #[doc = ""]
    pub CloseProfitByDate: TThostFtdcMoneyType,
    #[doc = ""]
    pub CloseProfitByTrade: TThostFtdcMoneyType,
    #[doc = ""]
    pub TodayPosition: TThostFtdcVolumeType,
    #[doc = ""]
    pub MarginRateByMoney: TThostFtdcRatioType,
    #[doc = "()"]
    pub MarginRateByVolume: TThostFtdcRatioType,
    #[doc = ""]
    pub StrikeFrozen: TThostFtdcVolumeType,
    #[doc = ""]
    pub StrikeFrozenAmount: TThostFtdcMoneyType,
    #[doc = ""]
    pub AbandonFrozen: TThostFtdcVolumeType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub YdStrikeFrozen: TThostFtdcVolumeType,
    #[doc = ""]
    pub InvestUnitID: TThostFtdcInvestUnitIDType,
    #[doc = ""]
    pub PositionCostOffset: TThostFtdcMoneyType,
    #[doc = "tas"]
    pub TasPosition: TThostFtdcVolumeType,
    #[doc = "tas"]
    pub TasPositionCost: TThostFtdcMoneyType,
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcInvestorPositionField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcInvestorPositionField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcInvestorPositionField>(),
        472usize,
        concat!("Size of: ", stringify!(CThostFtdcInvestorPositionField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcInvestorPositionField>(),
        8usize,
        concat!("Alignment of ", stringify!(CThostFtdcInvestorPositionField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(reserve1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestorID) as usize - ptr as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PosiDirection) as usize - ptr as usize },
        55usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(PosiDirection)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HedgeFlag) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(HedgeFlag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PositionDate) as usize - ptr as usize },
        57usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(PositionDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).YdPosition) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(YdPosition)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Position) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(Position)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LongFrozen) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(LongFrozen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ShortFrozen) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(ShortFrozen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LongFrozenAmount) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(LongFrozenAmount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ShortFrozenAmount) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(ShortFrozenAmount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OpenVolume) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(OpenVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CloseVolume) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(CloseVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OpenAmount) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(OpenAmount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CloseAmount) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(CloseAmount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PositionCost) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(PositionCost)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreMargin) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(PreMargin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UseMargin) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(UseMargin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FrozenMargin) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(FrozenMargin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FrozenCash) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(FrozenCash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FrozenCommission) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(FrozenCommission)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CashIn) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(CashIn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Commission) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(Commission)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CloseProfit) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(CloseProfit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PositionProfit) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(PositionProfit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreSettlementPrice) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(PreSettlementPrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SettlementPrice) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(SettlementPrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradingDay) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SettlementID) as usize - ptr as usize },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(SettlementID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OpenCost) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(OpenCost)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeMargin) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(ExchangeMargin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CombPosition) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(CombPosition)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CombLongFrozen) as usize - ptr as usize },
        252usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(CombLongFrozen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CombShortFrozen) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(CombShortFrozen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CloseProfitByDate) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(CloseProfitByDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CloseProfitByTrade) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(CloseProfitByTrade)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TodayPosition) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(TodayPosition)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MarginRateByMoney) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(MarginRateByMoney)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MarginRateByVolume) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(MarginRateByVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).StrikeFrozen) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(StrikeFrozen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).StrikeFrozenAmount) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(StrikeFrozenAmount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AbandonFrozen) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(AbandonFrozen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeID) as usize - ptr as usize },
        324usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).YdStrikeFrozen) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(YdStrikeFrozen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestUnitID) as usize - ptr as usize },
        340usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(InvestUnitID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PositionCostOffset) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(PositionCostOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TasPosition) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(TasPosition)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TasPositionCost) as usize - ptr as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(TasPositionCost)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InstrumentID) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(InstrumentID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcInstrumentMarginRateField {
    #[doc = ""]
    pub reserve1: TThostFtdcOldInstrumentIDType,
    #[doc = ""]
    pub InvestorRange: TThostFtdcInvestorRangeType,
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub HedgeFlag: TThostFtdcHedgeFlagType,
    #[doc = ""]
    pub LongMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = ""]
    pub LongMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = ""]
    pub ShortMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = ""]
    pub ShortMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = ""]
    pub IsRelative: TThostFtdcBoolType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub InvestUnitID: TThostFtdcInvestUnitIDType,
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcInstrumentMarginRateField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcInstrumentMarginRateField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcInstrumentMarginRateField>(),
        208usize,
        concat!("Size of: ", stringify!(CThostFtdcInstrumentMarginRateField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcInstrumentMarginRateField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcInstrumentMarginRateField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(reserve1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestorRange) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(InvestorRange)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestorID) as usize - ptr as usize },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HedgeFlag) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(HedgeFlag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LongMarginRatioByMoney) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(LongMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LongMarginRatioByVolume) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(LongMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ShortMarginRatioByMoney) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(ShortMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ShortMarginRatioByVolume) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(ShortMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsRelative) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(IsRelative)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeID) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestUnitID) as usize - ptr as usize },
        109usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(InvestUnitID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InstrumentID) as usize - ptr as usize },
        126usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(InstrumentID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcInstrumentCommissionRateField {
    #[doc = ""]
    pub reserve1: TThostFtdcOldInstrumentIDType,
    #[doc = ""]
    pub InvestorRange: TThostFtdcInvestorRangeType,
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub OpenRatioByMoney: TThostFtdcRatioType,
    #[doc = ""]
    pub OpenRatioByVolume: TThostFtdcRatioType,
    #[doc = ""]
    pub CloseRatioByMoney: TThostFtdcRatioType,
    #[doc = ""]
    pub CloseRatioByVolume: TThostFtdcRatioType,
    #[doc = ""]
    pub CloseTodayRatioByMoney: TThostFtdcRatioType,
    #[doc = ""]
    pub CloseTodayRatioByVolume: TThostFtdcRatioType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub BizType: TThostFtdcBizTypeType,
    #[doc = ""]
    pub InvestUnitID: TThostFtdcInvestUnitIDType,
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcInstrumentCommissionRateField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcInstrumentCommissionRateField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcInstrumentCommissionRateField>(),
        216usize,
        concat!(
            "Size of: ",
            stringify!(CThostFtdcInstrumentCommissionRateField)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcInstrumentCommissionRateField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcInstrumentCommissionRateField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(reserve1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestorRange) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(InvestorRange)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestorID) as usize - ptr as usize },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OpenRatioByMoney) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(OpenRatioByMoney)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OpenRatioByVolume) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(OpenRatioByVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CloseRatioByMoney) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(CloseRatioByMoney)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CloseRatioByVolume) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(CloseRatioByVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CloseTodayRatioByMoney) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(CloseTodayRatioByMoney)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CloseTodayRatioByVolume) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(CloseTodayRatioByVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeID) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BizType) as usize - ptr as usize },
        113usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(BizType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestUnitID) as usize - ptr as usize },
        114usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(InvestUnitID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InstrumentID) as usize - ptr as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(InstrumentID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcDepthMarketDataField {
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub reserve1: TThostFtdcOldInstrumentIDType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub reserve2: TThostFtdcOldExchangeInstIDType,
    #[doc = ""]
    pub LastPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub PreSettlementPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub PreClosePrice: TThostFtdcPriceType,
    #[doc = ""]
    pub PreOpenInterest: TThostFtdcLargeVolumeType,
    #[doc = ""]
    pub OpenPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub HighestPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub LowestPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub Volume: TThostFtdcVolumeType,
    #[doc = ""]
    pub Turnover: TThostFtdcMoneyType,
    #[doc = ""]
    pub OpenInterest: TThostFtdcLargeVolumeType,
    #[doc = ""]
    pub ClosePrice: TThostFtdcPriceType,
    #[doc = ""]
    pub SettlementPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub UpperLimitPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub LowerLimitPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub PreDelta: TThostFtdcRatioType,
    #[doc = ""]
    pub CurrDelta: TThostFtdcRatioType,
    #[doc = ""]
    pub UpdateTime: TThostFtdcTimeType,
    #[doc = ""]
    pub UpdateMillisec: TThostFtdcMillisecType,
    #[doc = ""]
    pub BidPrice1: TThostFtdcPriceType,
    #[doc = ""]
    pub BidVolume1: TThostFtdcVolumeType,
    #[doc = ""]
    pub AskPrice1: TThostFtdcPriceType,
    #[doc = ""]
    pub AskVolume1: TThostFtdcVolumeType,
    #[doc = ""]
    pub BidPrice2: TThostFtdcPriceType,
    #[doc = ""]
    pub BidVolume2: TThostFtdcVolumeType,
    #[doc = ""]
    pub AskPrice2: TThostFtdcPriceType,
    #[doc = ""]
    pub AskVolume2: TThostFtdcVolumeType,
    #[doc = ""]
    pub BidPrice3: TThostFtdcPriceType,
    #[doc = ""]
    pub BidVolume3: TThostFtdcVolumeType,
    #[doc = ""]
    pub AskPrice3: TThostFtdcPriceType,
    #[doc = ""]
    pub AskVolume3: TThostFtdcVolumeType,
    #[doc = ""]
    pub BidPrice4: TThostFtdcPriceType,
    #[doc = ""]
    pub BidVolume4: TThostFtdcVolumeType,
    #[doc = ""]
    pub AskPrice4: TThostFtdcPriceType,
    #[doc = ""]
    pub AskVolume4: TThostFtdcVolumeType,
    #[doc = ""]
    pub BidPrice5: TThostFtdcPriceType,
    #[doc = ""]
    pub BidVolume5: TThostFtdcVolumeType,
    #[doc = ""]
    pub AskPrice5: TThostFtdcPriceType,
    #[doc = ""]
    pub AskVolume5: TThostFtdcVolumeType,
    #[doc = ""]
    pub AveragePrice: TThostFtdcPriceType,
    #[doc = ""]
    pub ActionDay: TThostFtdcDateType,
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
    #[doc = ""]
    pub ExchangeInstID: TThostFtdcExchangeInstIDType,
    #[doc = ""]
    pub BandingUpperPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub BandingLowerPrice: TThostFtdcPriceType,
}
#[test]
fn bindgen_test_layout_CThostFtdcDepthMarketDataField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcDepthMarketDataField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcDepthMarketDataField>(),
        584usize,
        concat!("Size of: ", stringify!(CThostFtdcDepthMarketDataField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcDepthMarketDataField>(),
        8usize,
        concat!("Alignment of ", stringify!(CThostFtdcDepthMarketDataField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradingDay) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve1) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(reserve1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeID) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve2) as usize - ptr as usize },
        49usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(reserve2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LastPrice) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(LastPrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreSettlementPrice) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(PreSettlementPrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreClosePrice) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(PreClosePrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreOpenInterest) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(PreOpenInterest)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OpenPrice) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(OpenPrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HighestPrice) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(HighestPrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LowestPrice) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(LowestPrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Volume) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(Volume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Turnover) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(Turnover)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OpenInterest) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(OpenInterest)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClosePrice) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(ClosePrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SettlementPrice) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(SettlementPrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UpperLimitPrice) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(UpperLimitPrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LowerLimitPrice) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(LowerLimitPrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreDelta) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(PreDelta)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrDelta) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(CurrDelta)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UpdateTime) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(UpdateTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UpdateMillisec) as usize - ptr as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(UpdateMillisec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BidPrice1) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidPrice1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BidVolume1) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidVolume1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AskPrice1) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskPrice1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AskVolume1) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskVolume1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BidPrice2) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidPrice2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BidVolume2) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidVolume2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AskPrice2) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskPrice2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AskVolume2) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskVolume2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BidPrice3) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidPrice3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BidVolume3) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidVolume3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AskPrice3) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskPrice3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AskVolume3) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskVolume3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BidPrice4) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidPrice4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BidVolume4) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidVolume4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AskPrice4) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskPrice4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AskVolume4) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskVolume4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BidPrice5) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidPrice5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BidVolume5) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidVolume5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AskPrice5) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskPrice5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AskVolume5) as usize - ptr as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskVolume5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AveragePrice) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AveragePrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ActionDay) as usize - ptr as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(ActionDay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InstrumentID) as usize - ptr as usize },
        401usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(InstrumentID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeInstID) as usize - ptr as usize },
        482usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(ExchangeInstID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BandingUpperPrice) as usize - ptr as usize },
        568usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BandingUpperPrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BandingLowerPrice) as usize - ptr as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BandingLowerPrice)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcInstrumentTradingRightField {
    #[doc = ""]
    pub reserve1: TThostFtdcOldInstrumentIDType,
    #[doc = ""]
    pub InvestorRange: TThostFtdcInvestorRangeType,
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub TradingRight: TThostFtdcTradingRightType,
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcInstrumentTradingRightField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcInstrumentTradingRightField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcInstrumentTradingRightField>(),
        138usize,
        concat!(
            "Size of: ",
            stringify!(CThostFtdcInstrumentTradingRightField)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcInstrumentTradingRightField>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcInstrumentTradingRightField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentTradingRightField),
            "::",
            stringify!(reserve1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestorRange) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentTradingRightField),
            "::",
            stringify!(InvestorRange)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentTradingRightField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestorID) as usize - ptr as usize },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentTradingRightField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradingRight) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentTradingRightField),
            "::",
            stringify!(TradingRight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InstrumentID) as usize - ptr as usize },
        57usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentTradingRightField),
            "::",
            stringify!(InstrumentID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcBrokerUserField {
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub UserName: TThostFtdcUserNameType,
    #[doc = ""]
    pub UserType: TThostFtdcUserTypeType,
    #[doc = ""]
    pub IsActive: TThostFtdcBoolType,
    #[doc = ""]
    pub IsUsingOTP: TThostFtdcBoolType,
    #[doc = ""]
    pub IsAuthForce: TThostFtdcBoolType,
}
#[test]
fn bindgen_test_layout_CThostFtdcBrokerUserField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcBrokerUserField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcBrokerUserField>(),
        124usize,
        concat!("Size of: ", stringify!(CThostFtdcBrokerUserField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcBrokerUserField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcBrokerUserField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserID) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserName) as usize - ptr as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserField),
            "::",
            stringify!(UserName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserType) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserField),
            "::",
            stringify!(UserType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsActive) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserField),
            "::",
            stringify!(IsActive)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsUsingOTP) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserField),
            "::",
            stringify!(IsUsingOTP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsAuthForce) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserField),
            "::",
            stringify!(IsAuthForce)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcBrokerUserPasswordField {
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub Password: TThostFtdcPasswordType,
    #[doc = ""]
    pub LastUpdateTime: TThostFtdcDateTimeType,
    #[doc = ""]
    pub LastLoginTime: TThostFtdcDateTimeType,
    #[doc = ""]
    pub ExpireDate: TThostFtdcDateType,
    #[doc = ""]
    pub WeakExpireDate: TThostFtdcDateType,
}
#[test]
fn bindgen_test_layout_CThostFtdcBrokerUserPasswordField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcBrokerUserPasswordField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcBrokerUserPasswordField>(),
        120usize,
        concat!("Size of: ", stringify!(CThostFtdcBrokerUserPasswordField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcBrokerUserPasswordField>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcBrokerUserPasswordField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserPasswordField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserID) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserPasswordField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Password) as usize - ptr as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserPasswordField),
            "::",
            stringify!(Password)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LastUpdateTime) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserPasswordField),
            "::",
            stringify!(LastUpdateTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LastLoginTime) as usize - ptr as usize },
        85usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserPasswordField),
            "::",
            stringify!(LastLoginTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExpireDate) as usize - ptr as usize },
        102usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserPasswordField),
            "::",
            stringify!(ExpireDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).WeakExpireDate) as usize - ptr as usize },
        111usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserPasswordField),
            "::",
            stringify!(WeakExpireDate)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcBrokerUserFunctionField {
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub BrokerFunctionCode: TThostFtdcBrokerFunctionCodeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcBrokerUserFunctionField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcBrokerUserFunctionField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcBrokerUserFunctionField>(),
        28usize,
        concat!("Size of: ", stringify!(CThostFtdcBrokerUserFunctionField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcBrokerUserFunctionField>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcBrokerUserFunctionField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserFunctionField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserID) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserFunctionField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerFunctionCode) as usize - ptr as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserFunctionField),
            "::",
            stringify!(BrokerFunctionCode)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTraderOfferField {
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub TraderID: TThostFtdcTraderIDType,
    #[doc = ""]
    pub ParticipantID: TThostFtdcParticipantIDType,
    #[doc = ""]
    pub Password: TThostFtdcPasswordType,
    #[doc = ""]
    pub InstallID: TThostFtdcInstallIDType,
    #[doc = ""]
    pub OrderLocalID: TThostFtdcOrderLocalIDType,
    #[doc = ""]
    pub TraderConnectStatus: TThostFtdcTraderConnectStatusType,
    #[doc = ""]
    pub ConnectRequestDate: TThostFtdcDateType,
    #[doc = ""]
    pub ConnectRequestTime: TThostFtdcTimeType,
    #[doc = ""]
    pub LastReportDate: TThostFtdcDateType,
    #[doc = ""]
    pub LastReportTime: TThostFtdcTimeType,
    #[doc = ""]
    pub ConnectDate: TThostFtdcDateType,
    #[doc = ""]
    pub ConnectTime: TThostFtdcTimeType,
    #[doc = ""]
    pub StartDate: TThostFtdcDateType,
    #[doc = ""]
    pub StartTime: TThostFtdcTimeType,
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub MaxTradeID: TThostFtdcTradeIDType,
    #[doc = ""]
    pub MaxOrderMessageReference: TThostFtdcReturnCodeType,
    #[doc = ""]
    pub OrderCancelAlg: TThostFtdcOrderCancelAlgType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTraderOfferField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcTraderOfferField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTraderOfferField>(),
        224usize,
        concat!("Size of: ", stringify!(CThostFtdcTraderOfferField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTraderOfferField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcTraderOfferField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TraderID) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(TraderID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ParticipantID) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(ParticipantID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Password) as usize - ptr as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(Password)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InstallID) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(InstallID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderLocalID) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(OrderLocalID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TraderConnectStatus) as usize - ptr as usize },
        101usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(TraderConnectStatus)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ConnectRequestDate) as usize - ptr as usize },
        102usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(ConnectRequestDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ConnectRequestTime) as usize - ptr as usize },
        111usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(ConnectRequestTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LastReportDate) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(LastReportDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LastReportTime) as usize - ptr as usize },
        129usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(LastReportTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ConnectDate) as usize - ptr as usize },
        138usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(ConnectDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ConnectTime) as usize - ptr as usize },
        147usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(ConnectTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).StartDate) as usize - ptr as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(StartDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).StartTime) as usize - ptr as usize },
        165usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(StartTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradingDay) as usize - ptr as usize },
        174usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        183usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MaxTradeID) as usize - ptr as usize },
        194usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(MaxTradeID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MaxOrderMessageReference) as usize - ptr as usize },
        215usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(MaxOrderMessageReference)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderCancelAlg) as usize - ptr as usize },
        222usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(OrderCancelAlg)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcSettlementInfoField {
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub SettlementID: TThostFtdcSettlementIDType,
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub SequenceNo: TThostFtdcSequenceNoType,
    #[doc = ""]
    pub Content: TThostFtdcContentType,
    #[doc = ""]
    pub AccountID: TThostFtdcAccountIDType,
    #[doc = ""]
    pub CurrencyID: TThostFtdcCurrencyIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcSettlementInfoField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcSettlementInfoField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcSettlementInfoField>(),
        564usize,
        concat!("Size of: ", stringify!(CThostFtdcSettlementInfoField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcSettlementInfoField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcSettlementInfoField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradingDay) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementInfoField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SettlementID) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementInfoField),
            "::",
            stringify!(SettlementID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementInfoField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestorID) as usize - ptr as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementInfoField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SequenceNo) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementInfoField),
            "::",
            stringify!(SequenceNo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Content) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementInfoField),
            "::",
            stringify!(Content)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AccountID) as usize - ptr as usize },
        545usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementInfoField),
            "::",
            stringify!(AccountID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrencyID) as usize - ptr as usize },
        558usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementInfoField),
            "::",
            stringify!(CurrencyID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcInstrumentMarginRateAdjustField {
    #[doc = ""]
    pub reserve1: TThostFtdcOldInstrumentIDType,
    #[doc = ""]
    pub InvestorRange: TThostFtdcInvestorRangeType,
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub HedgeFlag: TThostFtdcHedgeFlagType,
    #[doc = ""]
    pub LongMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = ""]
    pub LongMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = ""]
    pub ShortMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = ""]
    pub ShortMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = ""]
    pub IsRelative: TThostFtdcBoolType,
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcInstrumentMarginRateAdjustField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcInstrumentMarginRateAdjustField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcInstrumentMarginRateAdjustField>(),
        184usize,
        concat!(
            "Size of: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcInstrumentMarginRateAdjustField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(reserve1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestorRange) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(InvestorRange)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestorID) as usize - ptr as usize },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HedgeFlag) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(HedgeFlag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LongMarginRatioByMoney) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(LongMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LongMarginRatioByVolume) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(LongMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ShortMarginRatioByMoney) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(ShortMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ShortMarginRatioByVolume) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(ShortMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsRelative) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(IsRelative)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InstrumentID) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(InstrumentID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcExchangeMarginRateField {
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub reserve1: TThostFtdcOldInstrumentIDType,
    #[doc = ""]
    pub HedgeFlag: TThostFtdcHedgeFlagType,
    #[doc = ""]
    pub LongMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = ""]
    pub LongMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = ""]
    pub ShortMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = ""]
    pub ShortMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcExchangeMarginRateField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcExchangeMarginRateField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcExchangeMarginRateField>(),
        176usize,
        concat!("Size of: ", stringify!(CThostFtdcExchangeMarginRateField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcExchangeMarginRateField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcExchangeMarginRateField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve1) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateField),
            "::",
            stringify!(reserve1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HedgeFlag) as usize - ptr as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateField),
            "::",
            stringify!(HedgeFlag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LongMarginRatioByMoney) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateField),
            "::",
            stringify!(LongMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LongMarginRatioByVolume) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateField),
            "::",
            stringify!(LongMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ShortMarginRatioByMoney) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateField),
            "::",
            stringify!(ShortMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ShortMarginRatioByVolume) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateField),
            "::",
            stringify!(ShortMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeID) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InstrumentID) as usize - ptr as usize },
        89usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateField),
            "::",
            stringify!(InstrumentID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcExchangeMarginRateAdjustField {
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub reserve1: TThostFtdcOldInstrumentIDType,
    #[doc = ""]
    pub HedgeFlag: TThostFtdcHedgeFlagType,
    #[doc = ""]
    pub LongMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = ""]
    pub LongMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = ""]
    pub ShortMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = ""]
    pub ShortMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = ""]
    pub ExchLongMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = ""]
    pub ExchLongMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = ""]
    pub ExchShortMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = ""]
    pub ExchShortMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = ""]
    pub NoLongMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = ""]
    pub NoLongMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = ""]
    pub NoShortMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = ""]
    pub NoShortMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcExchangeMarginRateAdjustField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcExchangeMarginRateAdjustField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcExchangeMarginRateAdjustField>(),
        232usize,
        concat!(
            "Size of: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcExchangeMarginRateAdjustField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve1) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(reserve1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HedgeFlag) as usize - ptr as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(HedgeFlag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LongMarginRatioByMoney) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(LongMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LongMarginRatioByVolume) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(LongMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ShortMarginRatioByMoney) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(ShortMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ShortMarginRatioByVolume) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(ShortMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchLongMarginRatioByMoney) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(ExchLongMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchLongMarginRatioByVolume) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(ExchLongMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchShortMarginRatioByMoney) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(ExchShortMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).ExchShortMarginRatioByVolume) as usize - ptr as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(ExchShortMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NoLongMarginRatioByMoney) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(NoLongMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NoLongMarginRatioByVolume) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(NoLongMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NoShortMarginRatioByMoney) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(NoShortMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NoShortMarginRatioByVolume) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(NoShortMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InstrumentID) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(InstrumentID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcExchangeRateField {
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub FromCurrencyID: TThostFtdcCurrencyIDType,
    #[doc = ""]
    pub FromCurrencyUnit: TThostFtdcCurrencyUnitType,
    #[doc = ""]
    pub ToCurrencyID: TThostFtdcCurrencyIDType,
    #[doc = ""]
    pub ExchangeRate: TThostFtdcExchangeRateType,
}
#[test]
fn bindgen_test_layout_CThostFtdcExchangeRateField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcExchangeRateField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcExchangeRateField>(),
        40usize,
        concat!("Size of: ", stringify!(CThostFtdcExchangeRateField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcExchangeRateField>(),
        8usize,
        concat!("Alignment of ", stringify!(CThostFtdcExchangeRateField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeRateField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FromCurrencyID) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeRateField),
            "::",
            stringify!(FromCurrencyID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FromCurrencyUnit) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeRateField),
            "::",
            stringify!(FromCurrencyUnit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ToCurrencyID) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeRateField),
            "::",
            stringify!(ToCurrencyID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeRate) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeRateField),
            "::",
            stringify!(ExchangeRate)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcSettlementRefField {
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub SettlementID: TThostFtdcSettlementIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcSettlementRefField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcSettlementRefField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcSettlementRefField>(),
        16usize,
        concat!("Size of: ", stringify!(CThostFtdcSettlementRefField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcSettlementRefField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcSettlementRefField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradingDay) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementRefField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SettlementID) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementRefField),
            "::",
            stringify!(SettlementID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcCurrentTimeField {
    #[doc = ""]
    pub CurrDate: TThostFtdcDateType,
    #[doc = ""]
    pub CurrTime: TThostFtdcTimeType,
    #[doc = ""]
    pub CurrMillisec: TThostFtdcMillisecType,
    #[doc = ""]
    pub ActionDay: TThostFtdcDateType,
}
#[test]
fn bindgen_test_layout_CThostFtdcCurrentTimeField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcCurrentTimeField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcCurrentTimeField>(),
        36usize,
        concat!("Size of: ", stringify!(CThostFtdcCurrentTimeField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcCurrentTimeField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcCurrentTimeField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrDate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcCurrentTimeField),
            "::",
            stringify!(CurrDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrTime) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcCurrentTimeField),
            "::",
            stringify!(CurrTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrMillisec) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcCurrentTimeField),
            "::",
            stringify!(CurrMillisec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ActionDay) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcCurrentTimeField),
            "::",
            stringify!(ActionDay)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcCommPhaseField {
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub CommPhaseNo: TThostFtdcCommPhaseNoType,
    #[doc = ""]
    pub SystemID: TThostFtdcSystemIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcCommPhaseField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcCommPhaseField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcCommPhaseField>(),
        34usize,
        concat!("Size of: ", stringify!(CThostFtdcCommPhaseField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcCommPhaseField>(),
        2usize,
        concat!("Alignment of ", stringify!(CThostFtdcCommPhaseField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradingDay) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcCommPhaseField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CommPhaseNo) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcCommPhaseField),
            "::",
            stringify!(CommPhaseNo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SystemID) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcCommPhaseField),
            "::",
            stringify!(SystemID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcLoginInfoField {
    #[doc = ""]
    pub FrontID: TThostFtdcFrontIDType,
    #[doc = ""]
    pub SessionID: TThostFtdcSessionIDType,
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub LoginDate: TThostFtdcDateType,
    #[doc = ""]
    pub LoginTime: TThostFtdcTimeType,
    #[doc = ""]
    pub reserve1: TThostFtdcOldIPAddressType,
    #[doc = ""]
    pub UserProductInfo: TThostFtdcProductInfoType,
    #[doc = ""]
    pub InterfaceProductInfo: TThostFtdcProductInfoType,
    #[doc = ""]
    pub ProtocolInfo: TThostFtdcProtocolInfoType,
    #[doc = ""]
    pub SystemName: TThostFtdcSystemNameType,
    #[doc = ","]
    pub PasswordDeprecated: TThostFtdcPasswordType,
    #[doc = ""]
    pub MaxOrderRef: TThostFtdcOrderRefType,
    #[doc = ""]
    pub SHFETime: TThostFtdcTimeType,
    #[doc = ""]
    pub DCETime: TThostFtdcTimeType,
    #[doc = ""]
    pub CZCETime: TThostFtdcTimeType,
    #[doc = ""]
    pub FFEXTime: TThostFtdcTimeType,
    #[doc = "Mac"]
    pub MacAddress: TThostFtdcMacAddressType,
    #[doc = ""]
    pub OneTimePassword: TThostFtdcPasswordType,
    #[doc = ""]
    pub INETime: TThostFtdcTimeType,
    #[doc = ""]
    pub IsQryControl: TThostFtdcBoolType,
    #[doc = ""]
    pub LoginRemark: TThostFtdcLoginRemarkType,
    #[doc = ""]
    pub Password: TThostFtdcPasswordType,
    #[doc = "IP"]
    pub IPAddress: TThostFtdcIPAddressType,
}
#[test]
fn bindgen_test_layout_CThostFtdcLoginInfoField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcLoginInfoField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcLoginInfoField>(),
        420usize,
        concat!("Size of: ", stringify!(CThostFtdcLoginInfoField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcLoginInfoField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcLoginInfoField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FrontID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(FrontID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SessionID) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(SessionID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserID) as usize - ptr as usize },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LoginDate) as usize - ptr as usize },
        35usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(LoginDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LoginTime) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(LoginTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve1) as usize - ptr as usize },
        53usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(reserve1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserProductInfo) as usize - ptr as usize },
        69usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(UserProductInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InterfaceProductInfo) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(InterfaceProductInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProtocolInfo) as usize - ptr as usize },
        91usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(ProtocolInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SystemName) as usize - ptr as usize },
        102usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(SystemName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PasswordDeprecated) as usize - ptr as usize },
        143usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(PasswordDeprecated)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MaxOrderRef) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(MaxOrderRef)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SHFETime) as usize - ptr as usize },
        197usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(SHFETime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCETime) as usize - ptr as usize },
        206usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(DCETime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CZCETime) as usize - ptr as usize },
        215usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(CZCETime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FFEXTime) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(FFEXTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MacAddress) as usize - ptr as usize },
        233usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(MacAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OneTimePassword) as usize - ptr as usize },
        254usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(OneTimePassword)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).INETime) as usize - ptr as usize },
        295usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(INETime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsQryControl) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(IsQryControl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LoginRemark) as usize - ptr as usize },
        308usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(LoginRemark)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Password) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(Password)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IPAddress) as usize - ptr as usize },
        385usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(IPAddress)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcLogoutAllField {
    #[doc = ""]
    pub FrontID: TThostFtdcFrontIDType,
    #[doc = ""]
    pub SessionID: TThostFtdcSessionIDType,
    #[doc = ""]
    pub SystemName: TThostFtdcSystemNameType,
}
#[test]
fn bindgen_test_layout_CThostFtdcLogoutAllField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcLogoutAllField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcLogoutAllField>(),
        52usize,
        concat!("Size of: ", stringify!(CThostFtdcLogoutAllField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcLogoutAllField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcLogoutAllField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FrontID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLogoutAllField),
            "::",
            stringify!(FrontID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SessionID) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLogoutAllField),
            "::",
            stringify!(SessionID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SystemName) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLogoutAllField),
            "::",
            stringify!(SystemName)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcFrontStatusField {
    #[doc = ""]
    pub FrontID: TThostFtdcFrontIDType,
    #[doc = ""]
    pub LastReportDate: TThostFtdcDateType,
    #[doc = ""]
    pub LastReportTime: TThostFtdcTimeType,
    #[doc = ""]
    pub IsActive: TThostFtdcBoolType,
}
#[test]
fn bindgen_test_layout_CThostFtdcFrontStatusField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcFrontStatusField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcFrontStatusField>(),
        28usize,
        concat!("Size of: ", stringify!(CThostFtdcFrontStatusField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcFrontStatusField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcFrontStatusField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FrontID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcFrontStatusField),
            "::",
            stringify!(FrontID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LastReportDate) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcFrontStatusField),
            "::",
            stringify!(LastReportDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LastReportTime) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcFrontStatusField),
            "::",
            stringify!(LastReportTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsActive) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcFrontStatusField),
            "::",
            stringify!(IsActive)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcUserPasswordUpdateField {
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub OldPassword: TThostFtdcPasswordType,
    #[doc = ""]
    pub NewPassword: TThostFtdcPasswordType,
}
#[test]
fn bindgen_test_layout_CThostFtdcUserPasswordUpdateField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcUserPasswordUpdateField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcUserPasswordUpdateField>(),
        109usize,
        concat!("Size of: ", stringify!(CThostFtdcUserPasswordUpdateField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcUserPasswordUpdateField>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcUserPasswordUpdateField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcUserPasswordUpdateField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserID) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcUserPasswordUpdateField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OldPassword) as usize - ptr as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcUserPasswordUpdateField),
            "::",
            stringify!(OldPassword)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NewPassword) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcUserPasswordUpdateField),
            "::",
            stringify!(NewPassword)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcInputOrderField {
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub reserve1: TThostFtdcOldInstrumentIDType,
    #[doc = ""]
    pub OrderRef: TThostFtdcOrderRefType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub OrderPriceType: TThostFtdcOrderPriceTypeType,
    #[doc = ""]
    pub Direction: TThostFtdcDirectionType,
    #[doc = ""]
    pub CombOffsetFlag: TThostFtdcCombOffsetFlagType,
    #[doc = ""]
    pub CombHedgeFlag: TThostFtdcCombHedgeFlagType,
    #[doc = ""]
    pub LimitPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub VolumeTotalOriginal: TThostFtdcVolumeType,
    #[doc = ""]
    pub TimeCondition: TThostFtdcTimeConditionType,
    #[doc = "GTD"]
    pub GTDDate: TThostFtdcDateType,
    #[doc = ""]
    pub VolumeCondition: TThostFtdcVolumeConditionType,
    #[doc = ""]
    pub MinVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub ContingentCondition: TThostFtdcContingentConditionType,
    #[doc = ""]
    pub StopPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub ForceCloseReason: TThostFtdcForceCloseReasonType,
    #[doc = ""]
    pub IsAutoSuspend: TThostFtdcBoolType,
    #[doc = ""]
    pub BusinessUnit: TThostFtdcBusinessUnitType,
    #[doc = ""]
    pub RequestID: TThostFtdcRequestIDType,
    #[doc = ""]
    pub UserForceClose: TThostFtdcBoolType,
    #[doc = ""]
    pub IsSwapOrder: TThostFtdcBoolType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub InvestUnitID: TThostFtdcInvestUnitIDType,
    #[doc = ""]
    pub AccountID: TThostFtdcAccountIDType,
    #[doc = ""]
    pub CurrencyID: TThostFtdcCurrencyIDType,
    #[doc = ""]
    pub ClientID: TThostFtdcClientIDType,
    #[doc = ""]
    pub reserve2: TThostFtdcOldIPAddressType,
    #[doc = "Mac"]
    pub MacAddress: TThostFtdcMacAddressType,
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
    #[doc = "IP"]
    pub IPAddress: TThostFtdcIPAddressType,
}
#[test]
fn bindgen_test_layout_CThostFtdcInputOrderField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcInputOrderField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcInputOrderField>(),
        392usize,
        concat!("Size of: ", stringify!(CThostFtdcInputOrderField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcInputOrderField>(),
        8usize,
        concat!("Alignment of ", stringify!(CThostFtdcInputOrderField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestorID) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(reserve1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderRef) as usize - ptr as usize },
        55usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(OrderRef)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserID) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderPriceType) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(OrderPriceType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Direction) as usize - ptr as usize },
        85usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(Direction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CombOffsetFlag) as usize - ptr as usize },
        86usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(CombOffsetFlag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CombHedgeFlag) as usize - ptr as usize },
        91usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(CombHedgeFlag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LimitPrice) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(LimitPrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VolumeTotalOriginal) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(VolumeTotalOriginal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TimeCondition) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(TimeCondition)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GTDDate) as usize - ptr as usize },
        109usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(GTDDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VolumeCondition) as usize - ptr as usize },
        118usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(VolumeCondition)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinVolume) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(MinVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ContingentCondition) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(ContingentCondition)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).StopPrice) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(StopPrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ForceCloseReason) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(ForceCloseReason)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsAutoSuspend) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(IsAutoSuspend)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BusinessUnit) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(BusinessUnit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RequestID) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(RequestID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserForceClose) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(UserForceClose)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSwapOrder) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(IsSwapOrder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeID) as usize - ptr as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestUnitID) as usize - ptr as usize },
        189usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(InvestUnitID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AccountID) as usize - ptr as usize },
        206usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(AccountID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrencyID) as usize - ptr as usize },
        219usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(CurrencyID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientID) as usize - ptr as usize },
        223usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(ClientID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve2) as usize - ptr as usize },
        234usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(reserve2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MacAddress) as usize - ptr as usize },
        250usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(MacAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InstrumentID) as usize - ptr as usize },
        271usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(InstrumentID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IPAddress) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(IPAddress)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcOrderField {
    #[doc = ""]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub reserve1: TThostFtdcOldInstrumentIDType,
    #[doc = ""]
    pub OrderRef: TThostFtdcOrderRefType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub OrderPriceType: TThostFtdcOrderPriceTypeType,
    #[doc = ""]
    pub Direction: TThostFtdcDirectionType,
    #[doc = ""]
    pub CombOffsetFlag: TThostFtdcCombOffsetFlagType,
    #[doc = ""]
    pub CombHedgeFlag: TThostFtdcCombHedgeFlagType,
    #[doc = ""]
    pub LimitPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub VolumeTotalOriginal: TThostFtdcVolumeType,
    #[doc = ""]
    pub TimeCondition: TThostFtdcTimeConditionType,
    #[doc = "GTD"]
    pub GTDDate: TThostFtdcDateType,
    #[doc = ""]
    pub VolumeCondition: TThostFtdcVolumeConditionType,
    #[doc = ""]
    pub MinVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub ContingentCondition: TThostFtdcContingentConditionType,
    #[doc = ""]
    pub StopPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub ForceCloseReason: TThostFtdcForceCloseReasonType,
    #[doc = ""]
    pub IsAutoSuspend: TThostFtdcBoolType,
    #[doc = ""]
    pub BusinessUnit: TThostFtdcBusinessUnitType,
    #[doc = ""]
    pub RequestID: TThostFtdcRequestIDType,
    #[doc = ""]
    pub OrderLocalID: TThostFtdcOrderLocalIDType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub ParticipantID: TThostFtdcParticipantIDType,
    #[doc = ""]
    pub ClientID: TThostFtdcClientIDType,
    #[doc = ""]
    pub reserve2: TThostFtdcOldExchangeInstIDType,
    #[doc = ""]
    pub TraderID: TThostFtdcTraderIDType,
    #[doc = ""]
    pub InstallID: TThostFtdcInstallIDType,
    #[doc = ""]
    pub OrderSubmitStatus: TThostFtdcOrderSubmitStatusType,
    #[doc = ""]
    pub NotifySequence: TThostFtdcSequenceNoType,
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub SettlementID: TThostFtdcSettlementIDType,
    #[doc = ""]
    pub OrderSysID: TThostFtdcOrderSysIDType,
    #[doc = ""]
    pub OrderSource: TThostFtdcOrderSourceType,
    #[doc = ""]
    pub OrderStatus: TThostFtdcOrderStatusType,
    #[doc = ""]
    pub OrderType: TThostFtdcOrderTypeType,
    #[doc = ""]
    pub VolumeTraded: TThostFtdcVolumeType,
    #[doc = ""]
    pub VolumeTotal: TThostFtdcVolumeType,
    #[doc = ""]
    pub InsertDate: TThostFtdcDateType,
    #[doc = ""]
    pub InsertTime: TThostFtdcTimeType,
    #[doc = ""]
    pub ActiveTime: TThostFtdcTimeType,
    #[doc = ""]
    pub SuspendTime: TThostFtdcTimeType,
    #[doc = ""]
    pub UpdateTime: TThostFtdcTimeType,
    #[doc = ""]
    pub CancelTime: TThostFtdcTimeType,
    #[doc = ""]
    pub ActiveTraderID: TThostFtdcTraderIDType,
    #[doc = ""]
    pub ClearingPartID: TThostFtdcParticipantIDType,
    #[doc = ""]
    pub SequenceNo: TThostFtdcSequenceNoType,
    #[doc = ""]
    pub FrontID: TThostFtdcFrontIDType,
    #[doc = ""]
    pub SessionID: TThostFtdcSessionIDType,
    #[doc = ""]
    pub UserProductInfo: TThostFtdcProductInfoType,
    #[doc = ""]
    pub StatusMsg: TThostFtdcErrorMsgType,
    #[doc = ""]
    pub UserForceClose: TThostFtdcBoolType,
    #[doc = ""]
    pub ActiveUserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub BrokerOrderSeq: TThostFtdcSequenceNoType,
    #[doc = ""]
    pub RelativeOrderSysID: TThostFtdcOrderSysIDType,
    #[doc = ""]
    pub ZCETotalTradedVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub IsSwapOrder: TThostFtdcBoolType,
    #[doc = ""]
    pub BranchID: TThostFtdcBranchIDType,
    #[doc = ""]
    pub InvestUnitID: TThostFtdcInvestUnitIDType,
    #[doc = ""]
    pub AccountID: TThostFtdcAccountIDType,
    #[doc = ""]
    pub CurrencyID: TThostFtdcCurrencyIDType,
    #[doc = ""]
    pub reserve3: TThostFtdcOldIPAddressType,
    #[doc = "Mac"]
    pub MacAddress: TThostFtdcMacAddressType,
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
    #[doc = ""]
    pub ExchangeInstID: TThostFtdcExchangeInstIDType,
    #[doc = "IP"]
    pub IPAddress: TThostFtdcIPAddressType,
}
#[test]
fn bindgen_test_layout_CThostFtdcOrderField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcOrderField> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcOrderField>(),
        856usize,
        concat!("Size of: ", stringify!(CThostFtdcOrderField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcOrderField>(),
        8usize,
        concat!("Alignment of ", stringify!(CThostFtdcOrderField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestorID) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(reserve1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderRef) as usize - ptr as usize },
        55usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(OrderRef)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserID) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderPriceType) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(OrderPriceType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Direction) as usize - ptr as usize },
        85usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(Direction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CombOffsetFlag) as usize - ptr as usize },
        86usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(CombOffsetFlag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CombHedgeFlag) as usize - ptr as usize },
        91usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(CombHedgeFlag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LimitPrice) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(LimitPrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VolumeTotalOriginal) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(VolumeTotalOriginal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TimeCondition) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(TimeCondition)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GTDDate) as usize - ptr as usize },
        109usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(GTDDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VolumeCondition) as usize - ptr as usize },
        118usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(VolumeCondition)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinVolume) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(MinVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ContingentCondition) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ContingentCondition)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).StopPrice) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(StopPrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ForceCloseReason) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ForceCloseReason)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsAutoSuspend) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(IsAutoSuspend)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BusinessUnit) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(BusinessUnit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RequestID) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(RequestID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderLocalID) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(OrderLocalID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeID) as usize - ptr as usize },
        185usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ParticipantID) as usize - ptr as usize },
        194usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ParticipantID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientID) as usize - ptr as usize },
        205usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ClientID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve2) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(reserve2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TraderID) as usize - ptr as usize },
        247usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(TraderID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InstallID) as usize - ptr as usize },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(InstallID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderSubmitStatus) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(OrderSubmitStatus)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NotifySequence) as usize - ptr as usize },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(NotifySequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradingDay) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SettlementID) as usize - ptr as usize },
        292usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(SettlementID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderSysID) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(OrderSysID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderSource) as usize - ptr as usize },
        317usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(OrderSource)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderStatus) as usize - ptr as usize },
        318usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(OrderStatus)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderType) as usize - ptr as usize },
        319usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(OrderType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VolumeTraded) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(VolumeTraded)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VolumeTotal) as usize - ptr as usize },
        324usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(VolumeTotal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InsertDate) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(InsertDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InsertTime) as usize - ptr as usize },
        337usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(InsertTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ActiveTime) as usize - ptr as usize },
        346usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ActiveTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SuspendTime) as usize - ptr as usize },
        355usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(SuspendTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UpdateTime) as usize - ptr as usize },
        364usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(UpdateTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CancelTime) as usize - ptr as usize },
        373usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(CancelTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ActiveTraderID) as usize - ptr as usize },
        382usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ActiveTraderID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClearingPartID) as usize - ptr as usize },
        403usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ClearingPartID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SequenceNo) as usize - ptr as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(SequenceNo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FrontID) as usize - ptr as usize },
        420usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(FrontID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SessionID) as usize - ptr as usize },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(SessionID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserProductInfo) as usize - ptr as usize },
        428usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(UserProductInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).StatusMsg) as usize - ptr as usize },
        439usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(StatusMsg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UserForceClose) as usize - ptr as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(UserForceClose)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ActiveUserID) as usize - ptr as usize },
        524usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ActiveUserID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BrokerOrderSeq) as usize - ptr as usize },
        540usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(BrokerOrderSeq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RelativeOrderSysID) as usize - ptr as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(RelativeOrderSysID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ZCETotalTradedVolume) as usize - ptr as usize },
        568usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ZCETotalTradedVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSwapOrder) as usize - ptr as usize },
        572usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(IsSwapOrder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BranchID) as usize - ptr as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(BranchID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InvestUnitID) as usize - ptr as usize },
        585usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(InvestUnitID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AccountID) as usize - ptr as usize },
        602usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(AccountID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrencyID) as usize - ptr as usize },
        615usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(CurrencyID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve3) as usize - ptr as usize },
        619usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(reserve3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MacAddress) as usize - ptr as usize },
        635usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(MacAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InstrumentID) as usize - ptr as usize },
        656usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(InstrumentID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeInstID) as usize - ptr as usize },
        737usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ExchangeInstID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IPAddress) as usize - ptr as usize },
        818usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(IPAddress)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcExchangeOrderField {
    #[doc = ""]
    pub OrderPriceType: TThostFtdcOrderPriceTypeType,
    #[doc = ""]
    pub Direction: TThostFtdcDirectionType,
    #[doc = ""]
    pub CombOffsetFlag: TThostFtdcCombOffsetFlagType,
    #[doc = ""]
    pub CombHedgeFlag: TThostFtdcCombHedgeFlagType,
    #[doc = ""]
    pub LimitPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub VolumeTotalOriginal: TThostFtdcVolumeType,
    #[doc = ""]
    pub TimeCondition: TThostFtdcTimeConditionType,
    #[doc = "GTD"]
    pub GTDDate: TThostFtdcDateType,
    #[doc = ""]
    pub VolumeCondition: TThostFtdcVolumeConditionType,
    #[doc = ""]
    pub MinVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub ContingentCondition: TThostFtdcContingentConditionType,
    #[doc = ""]
    pub StopPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub ForceCloseReason: TThostFtdcForceCloseReasonType,
    #[doc = ""]
    pub IsAutoSuspend: TThostFtdcBoolType,
    #[doc = ""]
    pub BusinessUnit: TThostFtdcBusinessUnitType,
    #[doc = ""]
    pub RequestID: TThostFtdcRequestIDType,
    #[doc = ""]
    pub OrderLocalID: TThostFtdcOrderLocalIDType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub ParticipantID: TThostFtdcParticipantIDType,
    #[doc = ""]
    pub ClientID: TThostFtdcClientIDType,
    #[doc = ""]
    pub reserve1: TThostFtdcOldExchangeInstIDType,
    #[doc = ""]
    pub TraderID: TThostFtdcTraderIDType,
    #[doc = ""]
    pub InstallID: TThostFtdcInstallIDType,
    #[doc = ""]
    pub OrderSubmitStatus: TThostFtdcOrderSubmitStatusType,
    #[doc = ""]
    pub NotifySequence: TThostFtdcSequenceNoType,
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub SettlementID: TThostFtdcSettlementIDType,
    #[doc = ""]
    pub OrderSysID: TThostFtdcOrderSysIDType,
    #[doc = ""]
    pub OrderSource: TThostFtdcOrderSourceType,
    #[doc = ""]
    pub OrderStatus: TThostFtdcOrderStatusType,
    #[doc = ""]
    pub OrderType: TThostFtdcOrderTypeType,
    #[doc = ""]
    pub VolumeTraded: TThostFtdcVolumeType,
    #[doc = ""]
    pub VolumeTotal: TThostFtdcVolumeType,
    #[doc = ""]
    pub InsertDate: TThostFtdcDateType,
    #[doc = ""]
    pub InsertTime: TThostFtdcTimeType,
    #[doc = ""]
    pub ActiveTime: TThostFtdcTimeType,
    #[doc = ""]
    pub SuspendTime: TThostFtdcTimeType,
    #[doc = ""]
    pub UpdateTime: TThostFtdcTimeType,
    #[doc = ""]
    pub CancelTime: TThostFtdcTimeType,
    #[doc = ""]
    pub ActiveTraderID: TThostFtdcTraderIDType,
    #[doc = ""]
    pub ClearingPartID: TThostFtdcParticipantIDType,
    #[doc = ""]
    pub SequenceNo: TThostFtdcSequenceNoType,
    #[doc = ""]
    pub BranchID: TThostFtdcBranchIDType,
    #[doc = ""]
    pub reserve2: TThostFtdcOldIPAddressType,
    #[doc = "Mac"]
    pub MacAddress: TThostFtdcMacAddressType,
    #[doc = ""]
    pub ExchangeInstID: TThostFtdcExchangeInstIDType,
    #[doc = "IP"]
    pub IPAddress: TThostFtdcIPAddressType,
}
#[test]
fn bindgen_test_layout_CThostFtdcExchangeOrderField() {
    const UNINIT: ::std::mem::MaybeUninit<CThostFtdcExchangeOrderField> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcExchangeOrderField>(),
        504usize,
        concat!("Size of: ", stringify!(CThostFtdcExchangeOrderField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcExchangeOrderField>(),
        8usize,
        concat!("Alignment of ", stringify!(CThostFtdcExchangeOrderField))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderPriceType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(OrderPriceType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Direction) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(Direction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CombOffsetFlag) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(CombOffsetFlag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CombHedgeFlag) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(CombHedgeFlag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LimitPrice) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(LimitPrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VolumeTotalOriginal) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(VolumeTotalOriginal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TimeCondition) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(TimeCondition)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GTDDate) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(GTDDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VolumeCondition) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(VolumeCondition)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinVolume) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(MinVolume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ContingentCondition) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(ContingentCondition)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).StopPrice) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(StopPrice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ForceCloseReason) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(ForceCloseReason)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsAutoSuspend) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(IsAutoSuspend)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BusinessUnit) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(BusinessUnit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RequestID) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(RequestID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderLocalID) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(OrderLocalID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeID) as usize - ptr as usize },
        105usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ParticipantID) as usize - ptr as usize },
        114usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(ParticipantID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClientID) as usize - ptr as usize },
        125usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(ClientID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve1) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(reserve1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TraderID) as usize - ptr as usize },
        167usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(TraderID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InstallID) as usize - ptr as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(InstallID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderSubmitStatus) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(OrderSubmitStatus)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NotifySequence) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(NotifySequence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TradingDay) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SettlementID) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(SettlementID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderSysID) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(OrderSysID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderSource) as usize - ptr as usize },
        237usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(OrderSource)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderStatus) as usize - ptr as usize },
        238usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(OrderStatus)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrderType) as usize - ptr as usize },
        239usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(OrderType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VolumeTraded) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(VolumeTraded)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VolumeTotal) as usize - ptr as usize },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(VolumeTotal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InsertDate) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(InsertDate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InsertTime) as usize - ptr as usize },
        257usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(InsertTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ActiveTime) as usize - ptr as usize },
        266usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(ActiveTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SuspendTime) as usize - ptr as usize },
        275usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(SuspendTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UpdateTime) as usize - ptr as usize },
        284usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(UpdateTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CancelTime) as usize - ptr as usize },
        293usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(CancelTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ActiveTraderID) as usize - ptr as usize },
        302usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(ActiveTraderID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ClearingPartID) as usize - ptr as usize },
        323usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(ClearingPartID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SequenceNo) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(SequenceNo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BranchID) as usize - ptr as usize },
        340usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(BranchID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve2) as usize - ptr as usize },
        349usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(reserve2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MacAddress) as usize - ptr as usize },
        365usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(MacAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExchangeInstID) as usize - ptr as usize },
        386usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(ExchangeInstID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IPAddress) as usize - ptr as usize },
        467usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(IPAddress)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcExchangeOrderInsertErrorField {
    #[doc = ""]
